Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xfd0 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x239a0): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x8a0b5): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa7e16): /home/shokto/STM32CubeIDE/workspace_1.7.0/L432KC_Baseline/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x10d18): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5cd45): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)

    <7a>   DW_AT_name        : (indirect string, offset: 0x7cbc3): __int32_t
    <7e>   DW_AT_decl_file   : 2
    <7f>   DW_AT_decl_line   : 77
    <80>   DW_AT_decl_column : 24
    <81>   DW_AT_type        : <0x85>
 <1><85>: Abbrev Number: 3 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : (indirect string, offset: 0x116e7): long int
 <1><8c>: Abbrev Number: 4 (DW_TAG_typedef)
    <8d>   DW_AT_name        : (indirect string, offset: 0x81644): __uint32_t
    <91>   DW_AT_decl_file   : 2
    <92>   DW_AT_decl_line   : 79
    <93>   DW_AT_decl_column : 25
    <94>   DW_AT_type        : <0x98>
 <1><98>: Abbrev Number: 3 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0x4d898): long unsigned int
 <1><9f>: Abbrev Number: 3 (DW_TAG_base_type)
    <a0>   DW_AT_byte_size   : 8
    <a1>   DW_AT_encoding    : 7	(unsigned)
    <a2>   DW_AT_name        : (indirect string, offset: 0x29e14): long long unsigned int
 <1><a6>: Abbrev Number: 4 (DW_TAG_typedef)
    <a7>   DW_AT_name        : (indirect string, offset: 0x3a3c1): uint8_t
    <ab>   DW_AT_decl_file   : 3
    <ac>   DW_AT_decl_line   : 24
    <ad>   DW_AT_decl_column : 19
    <ae>   DW_AT_type        : <0x4c>
 <1><b2>: Abbrev Number: 5 (DW_TAG_const_type)
    <b3>   DW_AT_type        : <0xa6>
 <1><b7>: Abbrev Number: 4 (DW_TAG_typedef)
    <b8>   DW_AT_name        : (indirect string, offset: 0x93975): uint16_t
    <bc>   DW_AT_decl_file   : 3
    <bd>   DW_AT_decl_line   : 36
    <be>   DW_AT_decl_column : 20
    <bf>   DW_AT_type        : <0x66>
 <1><c3>: Abbrev Number: 4 (DW_TAG_typedef)
    <c4>   DW_AT_name        : (indirect string, offset: 0x7cbc5): int32_t
    <c8>   DW_AT_decl_file   : 3
    <c9>   DW_AT_decl_line   : 44
    <ca>   DW_AT_decl_column : 19
    <cb>   DW_AT_type        : <0x79>
 <1><cf>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <d0>   DW_AT_type        : <0xc3>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x92f37): uint32_t
    <d9>   DW_AT_decl_file   : 3
    <da>   DW_AT_decl_line   : 48
    <db>   DW_AT_decl_column : 20
    <dc>   DW_AT_type        : <0x8c>
 <1><e0>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <e1>   DW_AT_type        : <0xd4>
 <1><e5>: Abbrev Number: 5 (DW_TAG_const_type)
    <e6>   DW_AT_type        : <0xd4>
 <1><ea>: Abbrev Number: 7 (DW_TAG_variable)
    <eb>   DW_AT_name        : (indirect string, offset: 0x9833c): SystemCoreClock
    <ef>   DW_AT_decl_file   : 9
    <f0>   DW_AT_decl_line   : 53
    <f1>   DW_AT_decl_column : 19
    <f2>   DW_AT_type        : <0xd4>
    <f6>   DW_AT_external    : 1
    <f6>   DW_AT_declaration : 1
 <1><f6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f7>   DW_AT_byte_size   : 4
 <1><f8>: Abbrev Number: 4 (DW_TAG_typedef)
    <f9>   DW_AT_name        : (indirect string, offset: 0x93ea7): StackType_t
    <fd>   DW_AT_decl_file   : 4
    <fe>   DW_AT_decl_line   : 55
    <ff>   DW_AT_decl_column : 24
    <100>   DW_AT_type        : <0xd4>
 <1><104>: Abbrev Number: 4 (DW_TAG_typedef)
    <105>   DW_AT_name        : (indirect string, offset: 0x1596): UBaseType_t
    <109>   DW_AT_decl_file   : 4
    <10a>   DW_AT_decl_line   : 57
    <10b>   DW_AT_decl_column : 23
    <10c>   DW_AT_type        : <0x98>
 <1><110>: Abbrev Number: 4 (DW_TAG_typedef)
    <111>   DW_AT_name        : (indirect string, offset: 0x6fc5c): TickType_t
    <115>   DW_AT_decl_file   : 4
    <116>   DW_AT_decl_line   : 63
    <117>   DW_AT_decl_column : 19
    <118>   DW_AT_type        : <0xd4>
 <1><11c>: Abbrev Number: 9 (DW_TAG_typedef)
    <11d>   DW_AT_name        : (indirect string, offset: 0x94e6d): wint_t
    <121>   DW_AT_decl_file   : 5
    <122>   DW_AT_decl_line   : 350
    <124>   DW_AT_decl_column : 23
    <125>   DW_AT_type        : <0x30>
 <1><129>: Abbrev Number: 4 (DW_TAG_typedef)
    <12a>   DW_AT_name        : (indirect string, offset: 0xb6ee3): _off_t
    <12e>   DW_AT_decl_file   : 6
    <12f>   DW_AT_decl_line   : 46
    <130>   DW_AT_decl_column : 14
    <131>   DW_AT_type        : <0x85>
 <1><135>: Abbrev Number: 4 (DW_TAG_typedef)
    <136>   DW_AT_name        : (indirect string, offset: 0x2c855): _fpos_t
    <13a>   DW_AT_decl_file   : 6
    <13b>   DW_AT_decl_line   : 116
    <13c>   DW_AT_decl_column : 14
    <13d>   DW_AT_type        : <0x85>
 <1><141>: Abbrev Number: 10 (DW_TAG_union_type)
    <142>   DW_AT_byte_size   : 4
    <143>   DW_AT_decl_file   : 6
    <144>   DW_AT_decl_line   : 165
    <145>   DW_AT_decl_column : 3
    <146>   DW_AT_sibling     : <0x163>
 <2><14a>: Abbrev Number: 11 (DW_TAG_member)
    <14b>   DW_AT_name        : (indirect string, offset: 0x9b0e4): __wch
    <14f>   DW_AT_decl_file   : 6
    <150>   DW_AT_decl_line   : 167
    <151>   DW_AT_decl_column : 12
    <152>   DW_AT_type        : <0x11c>
 <2><156>: Abbrev Number: 11 (DW_TAG_member)
    <157>   DW_AT_name        : (indirect string, offset: 0x68d82): __wchb
    <15b>   DW_AT_decl_file   : 6
    <15c>   DW_AT_decl_line   : 168
    <15d>   DW_AT_decl_column : 19
    <15e>   DW_AT_type        : <0x163>
 <2><162>: Abbrev Number: 0
 <1><163>: Abbrev Number: 12 (DW_TAG_array_type)
    <164>   DW_AT_type        : <0x58>
    <168>   DW_AT_sibling     : <0x173>
 <2><16c>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <16d>   DW_AT_type        : <0x30>
    <171>   DW_AT_upper_bound : 3
 <2><172>: Abbrev Number: 0
 <1><173>: Abbrev Number: 14 (DW_TAG_structure_type)
    <174>   DW_AT_byte_size   : 8
    <175>   DW_AT_decl_file   : 6
    <176>   DW_AT_decl_line   : 162
    <177>   DW_AT_decl_column : 9
    <178>   DW_AT_sibling     : <0x197>
 <2><17c>: Abbrev Number: 15 (DW_TAG_member)
    <17d>   DW_AT_name        : (indirect string, offset: 0x3866f): __count
    <181>   DW_AT_decl_file   : 6
    <182>   DW_AT_decl_line   : 164
    <183>   DW_AT_decl_column : 7
    <184>   DW_AT_type        : <0x29>
    <188>   DW_AT_data_member_location: 0
 <2><189>: Abbrev Number: 15 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0x2906a): __value
    <18e>   DW_AT_decl_file   : 6
    <18f>   DW_AT_decl_line   : 169
    <190>   DW_AT_decl_column : 5
    <191>   DW_AT_type        : <0x141>
    <195>   DW_AT_data_member_location: 4
 <2><196>: Abbrev Number: 0
 <1><197>: Abbrev Number: 4 (DW_TAG_typedef)
    <198>   DW_AT_name        : (indirect string, offset: 0x93780): _mbstate_t
    <19c>   DW_AT_decl_file   : 6
    <19d>   DW_AT_decl_line   : 170
    <19e>   DW_AT_decl_column : 3
    <19f>   DW_AT_type        : <0x173>
 <1><1a3>: Abbrev Number: 4 (DW_TAG_typedef)
    <1a4>   DW_AT_name        : (indirect string, offset: 0xb443c): __ULong
    <1a8>   DW_AT_decl_file   : 7
    <1a9>   DW_AT_decl_line   : 22
    <1aa>   DW_AT_decl_column : 25
    <1ab>   DW_AT_type        : <0x98>
 <1><1af>: Abbrev Number: 4 (DW_TAG_typedef)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x6f66a): _LOCK_T
    <1b4>   DW_AT_decl_file   : 8
    <1b5>   DW_AT_decl_line   : 34
    <1b6>   DW_AT_decl_column : 25
    <1b7>   DW_AT_type        : <0x1bb>
 <1><1bb>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1bc>   DW_AT_byte_size   : 4
    <1bd>   DW_AT_type        : <0x1c1>
 <1><1c1>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x198b2): __lock
    <1c6>   DW_AT_declaration : 1
 <1><1c6>: Abbrev Number: 4 (DW_TAG_typedef)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x64920): _flock_t
    <1cb>   DW_AT_decl_file   : 7
    <1cc>   DW_AT_decl_line   : 35
    <1cd>   DW_AT_decl_column : 27
    <1ce>   DW_AT_type        : <0x1af>
 <1><1d2>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x4540e): _Bigint
    <1d7>   DW_AT_byte_size   : 24
    <1d8>   DW_AT_decl_file   : 7
    <1d9>   DW_AT_decl_line   : 52
    <1da>   DW_AT_decl_column : 8
    <1db>   DW_AT_sibling     : <0x22c>
 <2><1df>: Abbrev Number: 15 (DW_TAG_member)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x78767): _next
    <1e4>   DW_AT_decl_file   : 7
    <1e5>   DW_AT_decl_line   : 54
    <1e6>   DW_AT_decl_column : 19
    <1e7>   DW_AT_type        : <0x22c>
    <1eb>   DW_AT_data_member_location: 0
 <2><1ec>: Abbrev Number: 19 (DW_TAG_member)
    <1ed>   DW_AT_name        : _k
    <1f0>   DW_AT_decl_file   : 7
    <1f1>   DW_AT_decl_line   : 55
    <1f2>   DW_AT_decl_column : 7
    <1f3>   DW_AT_type        : <0x29>
    <1f7>   DW_AT_data_member_location: 4
 <2><1f8>: Abbrev Number: 15 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x90ebe): _maxwds
    <1fd>   DW_AT_decl_file   : 7
    <1fe>   DW_AT_decl_line   : 55
    <1ff>   DW_AT_decl_column : 11
    <200>   DW_AT_type        : <0x29>
    <204>   DW_AT_data_member_location: 8
 <2><205>: Abbrev Number: 15 (DW_TAG_member)
    <206>   DW_AT_name        : (indirect string, offset: 0x6c421): _sign
    <20a>   DW_AT_decl_file   : 7
    <20b>   DW_AT_decl_line   : 55
    <20c>   DW_AT_decl_column : 20
    <20d>   DW_AT_type        : <0x29>
    <211>   DW_AT_data_member_location: 12
 <2><212>: Abbrev Number: 15 (DW_TAG_member)
    <213>   DW_AT_name        : (indirect string, offset: 0x6c0e0): _wds
    <217>   DW_AT_decl_file   : 7
    <218>   DW_AT_decl_line   : 55
    <219>   DW_AT_decl_column : 27
    <21a>   DW_AT_type        : <0x29>
    <21e>   DW_AT_data_member_location: 16
 <2><21f>: Abbrev Number: 19 (DW_TAG_member)
    <220>   DW_AT_name        : _x
    <223>   DW_AT_decl_file   : 7
    <224>   DW_AT_decl_line   : 56
    <225>   DW_AT_decl_column : 11
    <226>   DW_AT_type        : <0x232>
    <22a>   DW_AT_data_member_location: 20
 <2><22b>: Abbrev Number: 0
 <1><22c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <22d>   DW_AT_byte_size   : 4
    <22e>   DW_AT_type        : <0x1d2>
 <1><232>: Abbrev Number: 12 (DW_TAG_array_type)
    <233>   DW_AT_type        : <0x1a3>
    <237>   DW_AT_sibling     : <0x242>
 <2><23b>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <23c>   DW_AT_type        : <0x30>
    <240>   DW_AT_upper_bound : 0
 <2><241>: Abbrev Number: 0
 <1><242>: Abbrev Number: 18 (DW_TAG_structure_type)
    <243>   DW_AT_name        : (indirect string, offset: 0x3703b): __tm
    <247>   DW_AT_byte_size   : 36
    <248>   DW_AT_decl_file   : 7
    <249>   DW_AT_decl_line   : 60
    <24a>   DW_AT_decl_column : 8
    <24b>   DW_AT_sibling     : <0x2c5>
 <2><24f>: Abbrev Number: 15 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0xa59a0): __tm_sec
    <254>   DW_AT_decl_file   : 7
    <255>   DW_AT_decl_line   : 62
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_type        : <0x29>
    <25b>   DW_AT_data_member_location: 0
 <2><25c>: Abbrev Number: 15 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0xd23): __tm_min
    <261>   DW_AT_decl_file   : 7
    <262>   DW_AT_decl_line   : 63
    <263>   DW_AT_decl_column : 9
    <264>   DW_AT_type        : <0x29>
    <268>   DW_AT_data_member_location: 4
 <2><269>: Abbrev Number: 15 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x2accb): __tm_hour
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 64
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0x29>
    <275>   DW_AT_data_member_location: 8
 <2><276>: Abbrev Number: 15 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x76af9): __tm_mday
    <27b>   DW_AT_decl_file   : 7
    <27c>   DW_AT_decl_line   : 65
    <27d>   DW_AT_decl_column : 9
    <27e>   DW_AT_type        : <0x29>
    <282>   DW_AT_data_member_location: 12
 <2><283>: Abbrev Number: 15 (DW_TAG_member)
    <284>   DW_AT_name        : (indirect string, offset: 0x37e1): __tm_mon
    <288>   DW_AT_decl_file   : 7
    <289>   DW_AT_decl_line   : 66
    <28a>   DW_AT_decl_column : 9
    <28b>   DW_AT_type        : <0x29>
    <28f>   DW_AT_data_member_location: 16
 <2><290>: Abbrev Number: 15 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xbb9f6): __tm_year
    <295>   DW_AT_decl_file   : 7
    <296>   DW_AT_decl_line   : 67
    <297>   DW_AT_decl_column : 9
    <298>   DW_AT_type        : <0x29>
    <29c>   DW_AT_data_member_location: 20
 <2><29d>: Abbrev Number: 15 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0x55c38): __tm_wday
    <2a2>   DW_AT_decl_file   : 7
    <2a3>   DW_AT_decl_line   : 68
    <2a4>   DW_AT_decl_column : 9
    <2a5>   DW_AT_type        : <0x29>
    <2a9>   DW_AT_data_member_location: 24
 <2><2aa>: Abbrev Number: 15 (DW_TAG_member)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x4f2c9): __tm_yday
    <2af>   DW_AT_decl_file   : 7
    <2b0>   DW_AT_decl_line   : 69
    <2b1>   DW_AT_decl_column : 9
    <2b2>   DW_AT_type        : <0x29>
    <2b6>   DW_AT_data_member_location: 28
 <2><2b7>: Abbrev Number: 15 (DW_TAG_member)
    <2b8>   DW_AT_name        : (indirect string, offset: 0xb5959): __tm_isdst
    <2bc>   DW_AT_decl_file   : 7
    <2bd>   DW_AT_decl_line   : 70
    <2be>   DW_AT_decl_column : 9
    <2bf>   DW_AT_type        : <0x29>
    <2c3>   DW_AT_data_member_location: 32
 <2><2c4>: Abbrev Number: 0
 <1><2c5>: Abbrev Number: 20 (DW_TAG_structure_type)
    <2c6>   DW_AT_name        : (indirect string, offset: 0x617a0): _on_exit_args
    <2ca>   DW_AT_byte_size   : 264
    <2cc>   DW_AT_decl_file   : 7
    <2cd>   DW_AT_decl_line   : 79
    <2ce>   DW_AT_decl_column : 8
    <2cf>   DW_AT_sibling     : <0x30a>
 <2><2d3>: Abbrev Number: 15 (DW_TAG_member)
    <2d4>   DW_AT_name        : (indirect string, offset: 0xb3535): _fnargs
    <2d8>   DW_AT_decl_file   : 7
    <2d9>   DW_AT_decl_line   : 80
    <2da>   DW_AT_decl_column : 10
    <2db>   DW_AT_type        : <0x30a>
    <2df>   DW_AT_data_member_location: 0
 <2><2e0>: Abbrev Number: 15 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0xa90b5): _dso_handle
    <2e5>   DW_AT_decl_file   : 7
    <2e6>   DW_AT_decl_line   : 81
    <2e7>   DW_AT_decl_column : 9
    <2e8>   DW_AT_type        : <0x30a>
    <2ec>   DW_AT_data_member_location: 128
 <2><2ed>: Abbrev Number: 21 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x8dba1): _fntypes
    <2f2>   DW_AT_decl_file   : 7
    <2f3>   DW_AT_decl_line   : 83
    <2f4>   DW_AT_decl_column : 10
    <2f5>   DW_AT_type        : <0x1a3>
    <2f9>   DW_AT_data_member_location: 256
 <2><2fb>: Abbrev Number: 21 (DW_TAG_member)
    <2fc>   DW_AT_name        : (indirect string, offset: 0x53985): _is_cxa
    <300>   DW_AT_decl_file   : 7
    <301>   DW_AT_decl_line   : 86
    <302>   DW_AT_decl_column : 10
    <303>   DW_AT_type        : <0x1a3>
    <307>   DW_AT_data_member_location: 260
 <2><309>: Abbrev Number: 0
 <1><30a>: Abbrev Number: 12 (DW_TAG_array_type)
    <30b>   DW_AT_type        : <0xf6>
    <30f>   DW_AT_sibling     : <0x31a>
 <2><313>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <314>   DW_AT_type        : <0x30>
    <318>   DW_AT_upper_bound : 31
 <2><319>: Abbrev Number: 0
 <1><31a>: Abbrev Number: 18 (DW_TAG_structure_type)
    <31b>   DW_AT_name        : (indirect string, offset: 0x3b90): _atexit
    <31f>   DW_AT_byte_size   : 140
    <320>   DW_AT_decl_file   : 7
    <321>   DW_AT_decl_line   : 90
    <322>   DW_AT_decl_column : 8
    <323>   DW_AT_sibling     : <0x35c>
 <2><327>: Abbrev Number: 15 (DW_TAG_member)
    <328>   DW_AT_name        : (indirect string, offset: 0x78767): _next
    <32c>   DW_AT_decl_file   : 7
    <32d>   DW_AT_decl_line   : 91
    <32e>   DW_AT_decl_column : 18
    <32f>   DW_AT_type        : <0x35c>
    <333>   DW_AT_data_member_location: 0
 <2><334>: Abbrev Number: 15 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0x80b5d): _ind
    <339>   DW_AT_decl_file   : 7
    <33a>   DW_AT_decl_line   : 92
    <33b>   DW_AT_decl_column : 6
    <33c>   DW_AT_type        : <0x29>
    <340>   DW_AT_data_member_location: 4
 <2><341>: Abbrev Number: 15 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x2c498): _fns
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 93
    <348>   DW_AT_decl_column : 9
    <349>   DW_AT_type        : <0x362>
    <34d>   DW_AT_data_member_location: 8
 <2><34e>: Abbrev Number: 15 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0xa2c59): _on_exit_args_ptr
    <353>   DW_AT_decl_file   : 7
    <354>   DW_AT_decl_line   : 94
    <355>   DW_AT_decl_column : 32
    <356>   DW_AT_type        : <0x379>
    <35a>   DW_AT_data_member_location: 136
 <2><35b>: Abbrev Number: 0
 <1><35c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <35d>   DW_AT_byte_size   : 4
    <35e>   DW_AT_type        : <0x31a>
 <1><362>: Abbrev Number: 12 (DW_TAG_array_type)
    <363>   DW_AT_type        : <0x372>
    <367>   DW_AT_sibling     : <0x372>
 <2><36b>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <36c>   DW_AT_type        : <0x30>
    <370>   DW_AT_upper_bound : 31
 <2><371>: Abbrev Number: 0
 <1><372>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <373>   DW_AT_byte_size   : 4
    <374>   DW_AT_type        : <0x378>
 <1><378>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <379>   DW_AT_prototyped  : 1
 <1><379>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <37a>   DW_AT_byte_size   : 4
    <37b>   DW_AT_type        : <0x2c5>
 <1><37f>: Abbrev Number: 18 (DW_TAG_structure_type)
    <380>   DW_AT_name        : (indirect string, offset: 0x87d4f): __sbuf
    <384>   DW_AT_byte_size   : 8
    <385>   DW_AT_decl_file   : 7
    <386>   DW_AT_decl_line   : 122
    <387>   DW_AT_decl_column : 8
    <388>   DW_AT_sibling     : <0x3a7>
 <2><38c>: Abbrev Number: 15 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x433ce): _base
    <391>   DW_AT_decl_file   : 7
    <392>   DW_AT_decl_line   : 123
    <393>   DW_AT_decl_column : 17
    <394>   DW_AT_type        : <0x3a7>
    <398>   DW_AT_data_member_location: 0
 <2><399>: Abbrev Number: 15 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0xd1250): _size
    <39e>   DW_AT_decl_file   : 7
    <39f>   DW_AT_decl_line   : 124
    <3a0>   DW_AT_decl_column : 6
    <3a1>   DW_AT_type        : <0x29>
    <3a5>   DW_AT_data_member_location: 4
 <2><3a6>: Abbrev Number: 0
 <1><3a7>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <3a8>   DW_AT_byte_size   : 4
    <3a9>   DW_AT_type        : <0x58>
 <1><3ad>: Abbrev Number: 18 (DW_TAG_structure_type)
    <3ae>   DW_AT_name        : (indirect string, offset: 0x2598d): __sFILE_fake
    <3b2>   DW_AT_byte_size   : 32
    <3b3>   DW_AT_decl_file   : 7
    <3b4>   DW_AT_decl_line   : 158
    <3b5>   DW_AT_decl_column : 8
    <3b6>   DW_AT_sibling     : <0x420>
 <2><3ba>: Abbrev Number: 19 (DW_TAG_member)
    <3bb>   DW_AT_name        : _p
    <3be>   DW_AT_decl_file   : 7
    <3bf>   DW_AT_decl_line   : 159
    <3c0>   DW_AT_decl_column : 18
    <3c1>   DW_AT_type        : <0x3a7>
    <3c5>   DW_AT_data_member_location: 0
 <2><3c6>: Abbrev Number: 19 (DW_TAG_member)
    <3c7>   DW_AT_name        : _r
    <3ca>   DW_AT_decl_file   : 7
    <3cb>   DW_AT_decl_line   : 160
    <3cc>   DW_AT_decl_column : 7
    <3cd>   DW_AT_type        : <0x29>
    <3d1>   DW_AT_data_member_location: 4
 <2><3d2>: Abbrev Number: 19 (DW_TAG_member)
    <3d3>   DW_AT_name        : _w
    <3d6>   DW_AT_decl_file   : 7
    <3d7>   DW_AT_decl_line   : 161
    <3d8>   DW_AT_decl_column : 7
    <3d9>   DW_AT_type        : <0x29>
    <3dd>   DW_AT_data_member_location: 8
 <2><3de>: Abbrev Number: 15 (DW_TAG_member)
    <3df>   DW_AT_name        : (indirect string, offset: 0x5ce2e): _flags
    <3e3>   DW_AT_decl_file   : 7
    <3e4>   DW_AT_decl_line   : 162
    <3e5>   DW_AT_decl_column : 9
    <3e6>   DW_AT_type        : <0x5f>
    <3ea>   DW_AT_data_member_location: 12
 <2><3eb>: Abbrev Number: 15 (DW_TAG_member)
    <3ec>   DW_AT_name        : (indirect string, offset: 0x15b22): _file
    <3f0>   DW_AT_decl_file   : 7
    <3f1>   DW_AT_decl_line   : 163
    <3f2>   DW_AT_decl_column : 9
    <3f3>   DW_AT_type        : <0x5f>
    <3f7>   DW_AT_data_member_location: 14
 <2><3f8>: Abbrev Number: 19 (DW_TAG_member)
    <3f9>   DW_AT_name        : _bf
    <3fd>   DW_AT_decl_file   : 7
    <3fe>   DW_AT_decl_line   : 164
    <3ff>   DW_AT_decl_column : 17
    <400>   DW_AT_type        : <0x37f>
    <404>   DW_AT_data_member_location: 16
 <2><405>: Abbrev Number: 15 (DW_TAG_member)
    <406>   DW_AT_name        : (indirect string, offset: 0x5d3e8): _lbfsize
    <40a>   DW_AT_decl_file   : 7
    <40b>   DW_AT_decl_line   : 165
    <40c>   DW_AT_decl_column : 7
    <40d>   DW_AT_type        : <0x29>
    <411>   DW_AT_data_member_location: 24
 <2><412>: Abbrev Number: 15 (DW_TAG_member)
    <413>   DW_AT_name        : (indirect string, offset: 0xd4a9b): _data
    <417>   DW_AT_decl_file   : 7
    <418>   DW_AT_decl_line   : 167
    <419>   DW_AT_decl_column : 18
    <41a>   DW_AT_type        : <0x568>
    <41e>   DW_AT_data_member_location: 28
 <2><41f>: Abbrev Number: 0
 <1><420>: Abbrev Number: 5 (DW_TAG_const_type)
    <421>   DW_AT_type        : <0x3ad>
 <1><425>: Abbrev Number: 23 (DW_TAG_structure_type)
    <426>   DW_AT_name        : (indirect string, offset: 0xd672b): _reent
    <42a>   DW_AT_byte_size   : 96
    <42b>   DW_AT_decl_file   : 7
    <42c>   DW_AT_decl_line   : 377
    <42e>   DW_AT_decl_column : 8
    <42f>   DW_AT_sibling     : <0x568>
 <2><433>: Abbrev Number: 24 (DW_TAG_member)
    <434>   DW_AT_name        : (indirect string, offset: 0x76d5c): _errno
    <438>   DW_AT_decl_file   : 7
    <439>   DW_AT_decl_line   : 381
    <43b>   DW_AT_decl_column : 7
    <43c>   DW_AT_type        : <0x29>
    <440>   DW_AT_data_member_location: 0
 <2><441>: Abbrev Number: 24 (DW_TAG_member)
    <442>   DW_AT_name        : (indirect string, offset: 0x61432): _stdin
    <446>   DW_AT_decl_file   : 7
    <447>   DW_AT_decl_line   : 386
    <449>   DW_AT_decl_column : 11
    <44a>   DW_AT_type        : <0x7c0>
    <44e>   DW_AT_data_member_location: 4
 <2><44f>: Abbrev Number: 24 (DW_TAG_member)
    <450>   DW_AT_name        : (indirect string, offset: 0xc8e24): _stdout
    <454>   DW_AT_decl_file   : 7
    <455>   DW_AT_decl_line   : 386
    <457>   DW_AT_decl_column : 20
    <458>   DW_AT_type        : <0x7c0>
    <45c>   DW_AT_data_member_location: 8
 <2><45d>: Abbrev Number: 24 (DW_TAG_member)
    <45e>   DW_AT_name        : (indirect string, offset: 0xc83cb): _stderr
    <462>   DW_AT_decl_file   : 7
    <463>   DW_AT_decl_line   : 386
    <465>   DW_AT_decl_column : 30
    <466>   DW_AT_type        : <0x7c0>
    <46a>   DW_AT_data_member_location: 12
 <2><46b>: Abbrev Number: 24 (DW_TAG_member)
    <46c>   DW_AT_name        : (indirect string, offset: 0x80b58): _inc
    <470>   DW_AT_decl_file   : 7
    <471>   DW_AT_decl_line   : 388
    <473>   DW_AT_decl_column : 8
    <474>   DW_AT_type        : <0x29>
    <478>   DW_AT_data_member_location: 16
 <2><479>: Abbrev Number: 24 (DW_TAG_member)
    <47a>   DW_AT_name        : (indirect string, offset: 0x9fcc2): _emergency
    <47e>   DW_AT_decl_file   : 7
    <47f>   DW_AT_decl_line   : 390
    <481>   DW_AT_decl_column : 9
    <482>   DW_AT_type        : <0x6d4>
    <486>   DW_AT_data_member_location: 20
 <2><487>: Abbrev Number: 24 (DW_TAG_member)
    <488>   DW_AT_name        : (indirect string, offset: 0x2625d): __sdidinit
    <48c>   DW_AT_decl_file   : 7
    <48d>   DW_AT_decl_line   : 392
    <48f>   DW_AT_decl_column : 7
    <490>   DW_AT_type        : <0x29>
    <494>   DW_AT_data_member_location: 24
 <2><495>: Abbrev Number: 24 (DW_TAG_member)
    <496>   DW_AT_name        : (indirect string, offset: 0x125eb): _unspecified_locale_info
    <49a>   DW_AT_decl_file   : 7
    <49b>   DW_AT_decl_line   : 394
    <49d>   DW_AT_decl_column : 7
    <49e>   DW_AT_type        : <0x29>
    <4a2>   DW_AT_data_member_location: 28
 <2><4a3>: Abbrev Number: 24 (DW_TAG_member)
    <4a4>   DW_AT_name        : (indirect string, offset: 0xb2b7e): _locale
    <4a8>   DW_AT_decl_file   : 7
    <4a9>   DW_AT_decl_line   : 395
    <4ab>   DW_AT_decl_column : 22
    <4ac>   DW_AT_type        : <0x928>
    <4b0>   DW_AT_data_member_location: 32
 <2><4b1>: Abbrev Number: 25 (DW_TAG_member)
    <4b2>   DW_AT_name        : _mp
    <4b6>   DW_AT_decl_file   : 7
    <4b7>   DW_AT_decl_line   : 397
    <4b9>   DW_AT_decl_column : 18
    <4ba>   DW_AT_type        : <0x92e>
    <4be>   DW_AT_data_member_location: 36
 <2><4bf>: Abbrev Number: 24 (DW_TAG_member)
    <4c0>   DW_AT_name        : (indirect string, offset: 0x1f2fc): __cleanup
    <4c4>   DW_AT_decl_file   : 7
    <4c5>   DW_AT_decl_line   : 399
    <4c7>   DW_AT_decl_column : 10
    <4c8>   DW_AT_type        : <0x93f>
    <4cc>   DW_AT_data_member_location: 40
 <2><4cd>: Abbrev Number: 24 (DW_TAG_member)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x7d209): _gamma_signgam
    <4d2>   DW_AT_decl_file   : 7
    <4d3>   DW_AT_decl_line   : 401
    <4d5>   DW_AT_decl_column : 7
    <4d6>   DW_AT_type        : <0x29>
    <4da>   DW_AT_data_member_location: 44
 <2><4db>: Abbrev Number: 24 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0xa2184): _cvtlen
    <4e0>   DW_AT_decl_file   : 7
    <4e1>   DW_AT_decl_line   : 404
    <4e3>   DW_AT_decl_column : 7
    <4e4>   DW_AT_type        : <0x29>
    <4e8>   DW_AT_data_member_location: 48
 <2><4e9>: Abbrev Number: 24 (DW_TAG_member)
    <4ea>   DW_AT_name        : (indirect string, offset: 0x5dff2): _cvtbuf
    <4ee>   DW_AT_decl_file   : 7
    <4ef>   DW_AT_decl_line   : 405
    <4f1>   DW_AT_decl_column : 9
    <4f2>   DW_AT_type        : <0x6d4>
    <4f6>   DW_AT_data_member_location: 52
 <2><4f7>: Abbrev Number: 24 (DW_TAG_member)
    <4f8>   DW_AT_name        : (indirect string, offset: 0x97128): _r48
    <4fc>   DW_AT_decl_file   : 7
    <4fd>   DW_AT_decl_line   : 407
    <4ff>   DW_AT_decl_column : 19
    <500>   DW_AT_type        : <0x945>
    <504>   DW_AT_data_member_location: 56
 <2><505>: Abbrev Number: 24 (DW_TAG_member)
    <506>   DW_AT_name        : (indirect string, offset: 0xa8003): _localtime_buf
    <50a>   DW_AT_decl_file   : 7
    <50b>   DW_AT_decl_line   : 408
    <50d>   DW_AT_decl_column : 16
    <50e>   DW_AT_type        : <0x94b>
    <512>   DW_AT_data_member_location: 60
 <2><513>: Abbrev Number: 24 (DW_TAG_member)
    <514>   DW_AT_name        : (indirect string, offset: 0x2cab4): _asctime_buf
    <518>   DW_AT_decl_file   : 7
    <519>   DW_AT_decl_line   : 409
    <51b>   DW_AT_decl_column : 9
    <51c>   DW_AT_type        : <0x6d4>
    <520>   DW_AT_data_member_location: 64
 <2><521>: Abbrev Number: 24 (DW_TAG_member)
    <522>   DW_AT_name        : (indirect string, offset: 0xa5ef1): _sig_func
    <526>   DW_AT_decl_file   : 7
    <527>   DW_AT_decl_line   : 412
    <529>   DW_AT_decl_column : 12
    <52a>   DW_AT_type        : <0x95c>
    <52e>   DW_AT_data_member_location: 68
 <2><52f>: Abbrev Number: 24 (DW_TAG_member)
    <530>   DW_AT_name        : (indirect string, offset: 0x90d7c): __sglue
    <534>   DW_AT_decl_file   : 7
    <535>   DW_AT_decl_line   : 420
    <537>   DW_AT_decl_column : 16
    <538>   DW_AT_type        : <0x781>
    <53c>   DW_AT_data_member_location: 72
 <2><53d>: Abbrev Number: 24 (DW_TAG_member)
    <53e>   DW_AT_name        : (indirect string, offset: 0x36a2f): __sf
    <542>   DW_AT_decl_file   : 7
    <543>   DW_AT_decl_line   : 421
    <545>   DW_AT_decl_column : 11
    <546>   DW_AT_type        : <0x7c0>
    <54a>   DW_AT_data_member_location: 84
 <2><54b>: Abbrev Number: 24 (DW_TAG_member)
    <54c>   DW_AT_name        : (indirect string, offset: 0x5c165): _misc
    <550>   DW_AT_decl_file   : 7
    <551>   DW_AT_decl_line   : 422
    <553>   DW_AT_decl_column : 23
    <554>   DW_AT_type        : <0x968>
    <558>   DW_AT_data_member_location: 88
 <2><559>: Abbrev Number: 24 (DW_TAG_member)
    <55a>   DW_AT_name        : (indirect string, offset: 0x7e947): _signal_buf
    <55e>   DW_AT_decl_file   : 7
    <55f>   DW_AT_decl_line   : 423
    <561>   DW_AT_decl_column : 9
    <562>   DW_AT_type        : <0x6d4>
    <566>   DW_AT_data_member_location: 92
 <2><567>: Abbrev Number: 0
 <1><568>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <569>   DW_AT_byte_size   : 4
    <56a>   DW_AT_type        : <0x425>
 <1><56e>: Abbrev Number: 5 (DW_TAG_const_type)
    <56f>   DW_AT_type        : <0x568>
 <1><573>: Abbrev Number: 18 (DW_TAG_structure_type)
    <574>   DW_AT_name        : (indirect string, offset: 0x9ad56): __sFILE
    <578>   DW_AT_byte_size   : 104
    <579>   DW_AT_decl_file   : 7
    <57a>   DW_AT_decl_line   : 186
    <57b>   DW_AT_decl_column : 8
    <57c>   DW_AT_sibling     : <0x6b6>
 <2><580>: Abbrev Number: 19 (DW_TAG_member)
    <581>   DW_AT_name        : _p
    <584>   DW_AT_decl_file   : 7
    <585>   DW_AT_decl_line   : 187
    <586>   DW_AT_decl_column : 18
    <587>   DW_AT_type        : <0x3a7>
    <58b>   DW_AT_data_member_location: 0
 <2><58c>: Abbrev Number: 19 (DW_TAG_member)
    <58d>   DW_AT_name        : _r
    <590>   DW_AT_decl_file   : 7
    <591>   DW_AT_decl_line   : 188
    <592>   DW_AT_decl_column : 7
    <593>   DW_AT_type        : <0x29>
    <597>   DW_AT_data_member_location: 4
 <2><598>: Abbrev Number: 19 (DW_TAG_member)
    <599>   DW_AT_name        : _w
    <59c>   DW_AT_decl_file   : 7
    <59d>   DW_AT_decl_line   : 189
    <59e>   DW_AT_decl_column : 7
    <59f>   DW_AT_type        : <0x29>
    <5a3>   DW_AT_data_member_location: 8
 <2><5a4>: Abbrev Number: 15 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x5ce2e): _flags
    <5a9>   DW_AT_decl_file   : 7
    <5aa>   DW_AT_decl_line   : 190
    <5ab>   DW_AT_decl_column : 9
    <5ac>   DW_AT_type        : <0x5f>
    <5b0>   DW_AT_data_member_location: 12
 <2><5b1>: Abbrev Number: 15 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x15b22): _file
    <5b6>   DW_AT_decl_file   : 7
    <5b7>   DW_AT_decl_line   : 191
    <5b8>   DW_AT_decl_column : 9
    <5b9>   DW_AT_type        : <0x5f>
    <5bd>   DW_AT_data_member_location: 14
 <2><5be>: Abbrev Number: 19 (DW_TAG_member)
    <5bf>   DW_AT_name        : _bf
    <5c3>   DW_AT_decl_file   : 7
    <5c4>   DW_AT_decl_line   : 192
    <5c5>   DW_AT_decl_column : 17
    <5c6>   DW_AT_type        : <0x37f>
    <5ca>   DW_AT_data_member_location: 16
 <2><5cb>: Abbrev Number: 15 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0x5d3e8): _lbfsize
    <5d0>   DW_AT_decl_file   : 7
    <5d1>   DW_AT_decl_line   : 193
    <5d2>   DW_AT_decl_column : 7
    <5d3>   DW_AT_type        : <0x29>
    <5d7>   DW_AT_data_member_location: 24
 <2><5d8>: Abbrev Number: 15 (DW_TAG_member)
    <5d9>   DW_AT_name        : (indirect string, offset: 0xd4a9b): _data
    <5dd>   DW_AT_decl_file   : 7
    <5de>   DW_AT_decl_line   : 196
    <5df>   DW_AT_decl_column : 18
    <5e0>   DW_AT_type        : <0x568>
    <5e4>   DW_AT_data_member_location: 28
 <2><5e5>: Abbrev Number: 15 (DW_TAG_member)
    <5e6>   DW_AT_name        : (indirect string, offset: 0xb3b42): _cookie
    <5ea>   DW_AT_decl_file   : 7
    <5eb>   DW_AT_decl_line   : 200
    <5ec>   DW_AT_decl_column : 10
    <5ed>   DW_AT_type        : <0xf6>
    <5f1>   DW_AT_data_member_location: 32
 <2><5f2>: Abbrev Number: 15 (DW_TAG_member)
    <5f3>   DW_AT_name        : (indirect string, offset: 0x9f959): _read
    <5f7>   DW_AT_decl_file   : 7
    <5f8>   DW_AT_decl_line   : 202
    <5f9>   DW_AT_decl_column : 29
    <5fa>   DW_AT_type        : <0x6e6>
    <5fe>   DW_AT_data_member_location: 36
 <2><5ff>: Abbrev Number: 15 (DW_TAG_member)
    <600>   DW_AT_name        : (indirect string, offset: 0x19910): _write
    <604>   DW_AT_decl_file   : 7
    <605>   DW_AT_decl_line   : 204
    <606>   DW_AT_decl_column : 29
    <607>   DW_AT_type        : <0x710>
    <60b>   DW_AT_data_member_location: 40
 <2><60c>: Abbrev Number: 15 (DW_TAG_member)
    <60d>   DW_AT_name        : (indirect string, offset: 0x3a689): _seek
    <611>   DW_AT_decl_file   : 7
    <612>   DW_AT_decl_line   : 207
    <613>   DW_AT_decl_column : 13
    <614>   DW_AT_type        : <0x734>
    <618>   DW_AT_data_member_location: 44
 <2><619>: Abbrev Number: 15 (DW_TAG_member)
    <61a>   DW_AT_name        : (indirect string, offset: 0x592ee): _close
    <61e>   DW_AT_decl_file   : 7
    <61f>   DW_AT_decl_line   : 208
    <620>   DW_AT_decl_column : 9
    <621>   DW_AT_type        : <0x74e>
    <625>   DW_AT_data_member_location: 48
 <2><626>: Abbrev Number: 19 (DW_TAG_member)
    <627>   DW_AT_name        : _ub
    <62b>   DW_AT_decl_file   : 7
    <62c>   DW_AT_decl_line   : 211
    <62d>   DW_AT_decl_column : 17
    <62e>   DW_AT_type        : <0x37f>
    <632>   DW_AT_data_member_location: 52
 <2><633>: Abbrev Number: 19 (DW_TAG_member)
    <634>   DW_AT_name        : _up
    <638>   DW_AT_decl_file   : 7
    <639>   DW_AT_decl_line   : 212
    <63a>   DW_AT_decl_column : 18
    <63b>   DW_AT_type        : <0x3a7>
    <63f>   DW_AT_data_member_location: 60
 <2><640>: Abbrev Number: 19 (DW_TAG_member)
    <641>   DW_AT_name        : _ur
    <645>   DW_AT_decl_file   : 7
    <646>   DW_AT_decl_line   : 213
    <647>   DW_AT_decl_column : 7
    <648>   DW_AT_type        : <0x29>
    <64c>   DW_AT_data_member_location: 64
 <2><64d>: Abbrev Number: 15 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0xc41c4): _ubuf
    <652>   DW_AT_decl_file   : 7
    <653>   DW_AT_decl_line   : 216
    <654>   DW_AT_decl_column : 17
    <655>   DW_AT_type        : <0x754>
    <659>   DW_AT_data_member_location: 68
 <2><65a>: Abbrev Number: 15 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x8a39d): _nbuf
    <65f>   DW_AT_decl_file   : 7
    <660>   DW_AT_decl_line   : 217
    <661>   DW_AT_decl_column : 17
    <662>   DW_AT_type        : <0x764>
    <666>   DW_AT_data_member_location: 71
 <2><667>: Abbrev Number: 19 (DW_TAG_member)
    <668>   DW_AT_name        : _lb
    <66c>   DW_AT_decl_file   : 7
    <66d>   DW_AT_decl_line   : 220
    <66e>   DW_AT_decl_column : 17
    <66f>   DW_AT_type        : <0x37f>
    <673>   DW_AT_data_member_location: 72
 <2><674>: Abbrev Number: 15 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0x3319b): _blksize
    <679>   DW_AT_decl_file   : 7
    <67a>   DW_AT_decl_line   : 223
    <67b>   DW_AT_decl_column : 7
    <67c>   DW_AT_type        : <0x29>
    <680>   DW_AT_data_member_location: 80
 <2><681>: Abbrev Number: 15 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x409da): _offset
    <686>   DW_AT_decl_file   : 7
    <687>   DW_AT_decl_line   : 224
    <688>   DW_AT_decl_column : 10
    <689>   DW_AT_type        : <0x129>
    <68d>   DW_AT_data_member_location: 84
 <2><68e>: Abbrev Number: 15 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0x198b3): _lock
    <693>   DW_AT_decl_file   : 7
    <694>   DW_AT_decl_line   : 231
    <695>   DW_AT_decl_column : 12
    <696>   DW_AT_type        : <0x1c6>
    <69a>   DW_AT_data_member_location: 88
 <2><69b>: Abbrev Number: 15 (DW_TAG_member)
    <69c>   DW_AT_name        : (indirect string, offset: 0x17981): _mbstate
    <6a0>   DW_AT_decl_file   : 7
    <6a1>   DW_AT_decl_line   : 233
    <6a2>   DW_AT_decl_column : 14
    <6a3>   DW_AT_type        : <0x197>
    <6a7>   DW_AT_data_member_location: 92
 <2><6a8>: Abbrev Number: 15 (DW_TAG_member)
    <6a9>   DW_AT_name        : (indirect string, offset: 0xb8f39): _flags2
    <6ad>   DW_AT_decl_file   : 7
    <6ae>   DW_AT_decl_line   : 234
    <6af>   DW_AT_decl_column : 9
    <6b0>   DW_AT_type        : <0x29>
    <6b4>   DW_AT_data_member_location: 100
 <2><6b5>: Abbrev Number: 0
 <1><6b6>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <6b7>   DW_AT_prototyped  : 1
    <6b7>   DW_AT_type        : <0x29>
    <6bb>   DW_AT_sibling     : <0x6d4>
 <2><6bf>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6c0>   DW_AT_type        : <0x568>
 <2><6c4>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6c5>   DW_AT_type        : <0xf6>
 <2><6c9>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6ca>   DW_AT_type        : <0x6d4>
 <2><6ce>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6cf>   DW_AT_type        : <0x29>
 <2><6d3>: Abbrev Number: 0
 <1><6d4>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6d5>   DW_AT_byte_size   : 4
    <6d6>   DW_AT_type        : <0x6da>
 <1><6da>: Abbrev Number: 3 (DW_TAG_base_type)
    <6db>   DW_AT_byte_size   : 1
    <6dc>   DW_AT_encoding    : 8	(unsigned char)
    <6dd>   DW_AT_name        : (indirect string, offset: 0x40f70): char
 <1><6e1>: Abbrev Number: 5 (DW_TAG_const_type)
    <6e2>   DW_AT_type        : <0x6da>
 <1><6e6>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6e7>   DW_AT_byte_size   : 4
    <6e8>   DW_AT_type        : <0x6b6>
 <1><6ec>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <6ed>   DW_AT_prototyped  : 1
    <6ed>   DW_AT_type        : <0x29>
    <6f1>   DW_AT_sibling     : <0x70a>
 <2><6f5>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6f6>   DW_AT_type        : <0x568>
 <2><6fa>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6fb>   DW_AT_type        : <0xf6>
 <2><6ff>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <700>   DW_AT_type        : <0x70a>
 <2><704>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <705>   DW_AT_type        : <0x29>
 <2><709>: Abbrev Number: 0
 <1><70a>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <70b>   DW_AT_byte_size   : 4
    <70c>   DW_AT_type        : <0x6e1>
 <1><710>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <711>   DW_AT_byte_size   : 4
    <712>   DW_AT_type        : <0x6ec>
 <1><716>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <717>   DW_AT_prototyped  : 1
    <717>   DW_AT_type        : <0x135>
    <71b>   DW_AT_sibling     : <0x734>
 <2><71f>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <720>   DW_AT_type        : <0x568>
 <2><724>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <725>   DW_AT_type        : <0xf6>
 <2><729>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <72a>   DW_AT_type        : <0x135>
 <2><72e>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <72f>   DW_AT_type        : <0x29>
 <2><733>: Abbrev Number: 0
 <1><734>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <735>   DW_AT_byte_size   : 4
    <736>   DW_AT_type        : <0x716>
 <1><73a>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <73b>   DW_AT_prototyped  : 1
    <73b>   DW_AT_type        : <0x29>
    <73f>   DW_AT_sibling     : <0x74e>
 <2><743>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <744>   DW_AT_type        : <0x568>
 <2><748>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <749>   DW_AT_type        : <0xf6>
 <2><74d>: Abbrev Number: 0
 <1><74e>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <74f>   DW_AT_byte_size   : 4
    <750>   DW_AT_type        : <0x73a>
 <1><754>: Abbrev Number: 12 (DW_TAG_array_type)
    <755>   DW_AT_type        : <0x58>
    <759>   DW_AT_sibling     : <0x764>
 <2><75d>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <75e>   DW_AT_type        : <0x30>
    <762>   DW_AT_upper_bound : 2
 <2><763>: Abbrev Number: 0
 <1><764>: Abbrev Number: 12 (DW_TAG_array_type)
    <765>   DW_AT_type        : <0x58>
    <769>   DW_AT_sibling     : <0x774>
 <2><76d>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <76e>   DW_AT_type        : <0x30>
    <772>   DW_AT_upper_bound : 0
 <2><773>: Abbrev Number: 0
 <1><774>: Abbrev Number: 9 (DW_TAG_typedef)
    <775>   DW_AT_name        : (indirect string, offset: 0xa1e83): __FILE
    <779>   DW_AT_decl_file   : 7
    <77a>   DW_AT_decl_line   : 292
    <77c>   DW_AT_decl_column : 26
    <77d>   DW_AT_type        : <0x573>
 <1><781>: Abbrev Number: 23 (DW_TAG_structure_type)
    <782>   DW_AT_name        : (indirect string, offset: 0xad55c): _glue
    <786>   DW_AT_byte_size   : 12
    <787>   DW_AT_decl_file   : 7
    <788>   DW_AT_decl_line   : 296
    <78a>   DW_AT_decl_column : 8
    <78b>   DW_AT_sibling     : <0x7ba>
 <2><78f>: Abbrev Number: 24 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0x78767): _next
    <794>   DW_AT_decl_file   : 7
    <795>   DW_AT_decl_line   : 298
    <797>   DW_AT_decl_column : 17
    <798>   DW_AT_type        : <0x7ba>
    <79c>   DW_AT_data_member_location: 0
 <2><79d>: Abbrev Number: 24 (DW_TAG_member)
    <79e>   DW_AT_name        : (indirect string, offset: 0x4c02a): _niobs
    <7a2>   DW_AT_decl_file   : 7
    <7a3>   DW_AT_decl_line   : 299
    <7a5>   DW_AT_decl_column : 7
    <7a6>   DW_AT_type        : <0x29>
    <7aa>   DW_AT_data_member_location: 4
 <2><7ab>: Abbrev Number: 24 (DW_TAG_member)
    <7ac>   DW_AT_name        : (indirect string, offset: 0x67005): _iobs
    <7b0>   DW_AT_decl_file   : 7
    <7b1>   DW_AT_decl_line   : 300
    <7b3>   DW_AT_decl_column : 11
    <7b4>   DW_AT_type        : <0x7c0>
    <7b8>   DW_AT_data_member_location: 8
 <2><7b9>: Abbrev Number: 0
 <1><7ba>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <7bb>   DW_AT_byte_size   : 4
    <7bc>   DW_AT_type        : <0x781>
 <1><7c0>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <7c1>   DW_AT_byte_size   : 4
    <7c2>   DW_AT_type        : <0x774>
 <1><7c6>: Abbrev Number: 23 (DW_TAG_structure_type)
    <7c7>   DW_AT_name        : (indirect string, offset: 0x463fe): _rand48
    <7cb>   DW_AT_byte_size   : 24
    <7cc>   DW_AT_decl_file   : 7
    <7cd>   DW_AT_decl_line   : 324
    <7cf>   DW_AT_decl_column : 8
    <7d0>   DW_AT_sibling     : <0x80d>
 <2><7d4>: Abbrev Number: 24 (DW_TAG_member)
    <7d5>   DW_AT_name        : (indirect string, offset: 0xc6537): _seed
    <7d9>   DW_AT_decl_file   : 7
    <7da>   DW_AT_decl_line   : 325
    <7dc>   DW_AT_decl_column : 18
    <7dd>   DW_AT_type        : <0x80d>
    <7e1>   DW_AT_data_member_location: 0
 <2><7e2>: Abbrev Number: 24 (DW_TAG_member)
    <7e3>   DW_AT_name        : (indirect string, offset: 0xb88f2): _mult
    <7e7>   DW_AT_decl_file   : 7
    <7e8>   DW_AT_decl_line   : 326
    <7ea>   DW_AT_decl_column : 18
    <7eb>   DW_AT_type        : <0x80d>
    <7ef>   DW_AT_data_member_location: 6
 <2><7f0>: Abbrev Number: 24 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x68e31): _add
    <7f5>   DW_AT_decl_file   : 7
    <7f6>   DW_AT_decl_line   : 327
    <7f8>   DW_AT_decl_column : 18
    <7f9>   DW_AT_type        : <0x72>
    <7fd>   DW_AT_data_member_location: 12
 <2><7fe>: Abbrev Number: 24 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x78762): _rand_next
    <803>   DW_AT_decl_file   : 7
    <804>   DW_AT_decl_line   : 330
    <806>   DW_AT_decl_column : 36
    <807>   DW_AT_type        : <0x9f>
    <80b>   DW_AT_data_member_location: 16
 <2><80c>: Abbrev Number: 0
 <1><80d>: Abbrev Number: 12 (DW_TAG_array_type)
    <80e>   DW_AT_type        : <0x72>
    <812>   DW_AT_sibling     : <0x81d>
 <2><816>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <817>   DW_AT_type        : <0x30>
    <81b>   DW_AT_upper_bound : 2
 <2><81c>: Abbrev Number: 0
 <1><81d>: Abbrev Number: 23 (DW_TAG_structure_type)
    <81e>   DW_AT_name        : (indirect string, offset: 0x99d15): _mprec
    <822>   DW_AT_byte_size   : 16
    <823>   DW_AT_decl_file   : 7
    <824>   DW_AT_decl_line   : 349
    <826>   DW_AT_decl_column : 8
    <827>   DW_AT_sibling     : <0x864>
 <2><82b>: Abbrev Number: 24 (DW_TAG_member)
    <82c>   DW_AT_name        : (indirect string, offset: 0xc9527): _result
    <830>   DW_AT_decl_file   : 7
    <831>   DW_AT_decl_line   : 352
    <833>   DW_AT_decl_column : 19
    <834>   DW_AT_type        : <0x22c>
    <838>   DW_AT_data_member_location: 0
 <2><839>: Abbrev Number: 24 (DW_TAG_member)
    <83a>   DW_AT_name        : (indirect string, offset: 0x7e988): _result_k
    <83e>   DW_AT_decl_file   : 7
    <83f>   DW_AT_decl_line   : 353
    <841>   DW_AT_decl_column : 7
    <842>   DW_AT_type        : <0x29>
    <846>   DW_AT_data_member_location: 4
 <2><847>: Abbrev Number: 24 (DW_TAG_member)
    <848>   DW_AT_name        : (indirect string, offset: 0x60d0d): _p5s
    <84c>   DW_AT_decl_file   : 7
    <84d>   DW_AT_decl_line   : 354
    <84f>   DW_AT_decl_column : 19
    <850>   DW_AT_type        : <0x22c>
    <854>   DW_AT_data_member_location: 8
 <2><855>: Abbrev Number: 24 (DW_TAG_member)
    <856>   DW_AT_name        : (indirect string, offset: 0x753e9): _freelist
    <85a>   DW_AT_decl_file   : 7
    <85b>   DW_AT_decl_line   : 355
    <85d>   DW_AT_decl_column : 20
    <85e>   DW_AT_type        : <0x864>
    <862>   DW_AT_data_member_location: 12
 <2><863>: Abbrev Number: 0
 <1><864>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <865>   DW_AT_byte_size   : 4
    <866>   DW_AT_type        : <0x22c>
 <1><86a>: Abbrev Number: 23 (DW_TAG_structure_type)
    <86b>   DW_AT_name        : (indirect string, offset: 0x60cd5): _misc_reent
    <86f>   DW_AT_byte_size   : 80
    <870>   DW_AT_decl_file   : 7
    <871>   DW_AT_decl_line   : 359
    <873>   DW_AT_decl_column : 8
    <874>   DW_AT_sibling     : <0x913>
 <2><878>: Abbrev Number: 24 (DW_TAG_member)
    <879>   DW_AT_name        : (indirect string, offset: 0xb84d9): _strtok_last
    <87d>   DW_AT_decl_file   : 7
    <87e>   DW_AT_decl_line   : 362
    <880>   DW_AT_decl_column : 9
    <881>   DW_AT_type        : <0x6d4>
    <885>   DW_AT_data_member_location: 0
 <2><886>: Abbrev Number: 24 (DW_TAG_member)
    <887>   DW_AT_name        : (indirect string, offset: 0x586d1): _mblen_state
    <88b>   DW_AT_decl_file   : 7
    <88c>   DW_AT_decl_line   : 363
    <88e>   DW_AT_decl_column : 14
    <88f>   DW_AT_type        : <0x197>
    <893>   DW_AT_data_member_location: 4
 <2><894>: Abbrev Number: 24 (DW_TAG_member)
    <895>   DW_AT_name        : (indirect string, offset: 0xb84ff): _wctomb_state
    <899>   DW_AT_decl_file   : 7
    <89a>   DW_AT_decl_line   : 364
    <89c>   DW_AT_decl_column : 14
    <89d>   DW_AT_type        : <0x197>
    <8a1>   DW_AT_data_member_location: 12
 <2><8a2>: Abbrev Number: 24 (DW_TAG_member)
    <8a3>   DW_AT_name        : (indirect string, offset: 0xac8ae): _mbtowc_state
    <8a7>   DW_AT_decl_file   : 7
    <8a8>   DW_AT_decl_line   : 365
    <8aa>   DW_AT_decl_column : 14
    <8ab>   DW_AT_type        : <0x197>
    <8af>   DW_AT_data_member_location: 20
 <2><8b0>: Abbrev Number: 24 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0x3222b): _l64a_buf
    <8b5>   DW_AT_decl_file   : 7
    <8b6>   DW_AT_decl_line   : 366
    <8b8>   DW_AT_decl_column : 8
    <8b9>   DW_AT_type        : <0x913>
    <8bd>   DW_AT_data_member_location: 28
 <2><8be>: Abbrev Number: 24 (DW_TAG_member)
    <8bf>   DW_AT_name        : (indirect string, offset: 0xb6ed6): _getdate_err
    <8c3>   DW_AT_decl_file   : 7
    <8c4>   DW_AT_decl_line   : 367
    <8c6>   DW_AT_decl_column : 7
    <8c7>   DW_AT_type        : <0x29>
    <8cb>   DW_AT_data_member_location: 36
 <2><8cc>: Abbrev Number: 24 (DW_TAG_member)
    <8cd>   DW_AT_name        : (indirect string, offset: 0x61ffa): _mbrlen_state
    <8d1>   DW_AT_decl_file   : 7
    <8d2>   DW_AT_decl_line   : 368
    <8d4>   DW_AT_decl_column : 14
    <8d5>   DW_AT_type        : <0x197>
    <8d9>   DW_AT_data_member_location: 40
 <2><8da>: Abbrev Number: 24 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0xb74e0): _mbrtowc_state
    <8df>   DW_AT_decl_file   : 7
    <8e0>   DW_AT_decl_line   : 369
    <8e2>   DW_AT_decl_column : 14
    <8e3>   DW_AT_type        : <0x197>
    <8e7>   DW_AT_data_member_location: 48
 <2><8e8>: Abbrev Number: 24 (DW_TAG_member)
    <8e9>   DW_AT_name        : (indirect string, offset: 0x78469): _mbsrtowcs_state
    <8ed>   DW_AT_decl_file   : 7
    <8ee>   DW_AT_decl_line   : 370
    <8f0>   DW_AT_decl_column : 14
    <8f1>   DW_AT_type        : <0x197>
    <8f5>   DW_AT_data_member_location: 56
 <2><8f6>: Abbrev Number: 24 (DW_TAG_member)
    <8f7>   DW_AT_name        : (indirect string, offset: 0x3ded1): _wcrtomb_state
    <8fb>   DW_AT_decl_file   : 7
    <8fc>   DW_AT_decl_line   : 371
    <8fe>   DW_AT_decl_column : 14
    <8ff>   DW_AT_type        : <0x197>
    <903>   DW_AT_data_member_location: 64
 <2><904>: Abbrev Number: 24 (DW_TAG_member)
    <905>   DW_AT_name        : (indirect string, offset: 0x736eb): _wcsrtombs_state
    <909>   DW_AT_decl_file   : 7
    <90a>   DW_AT_decl_line   : 372
    <90c>   DW_AT_decl_column : 14
    <90d>   DW_AT_type        : <0x197>
    <911>   DW_AT_data_member_location: 72
 <2><912>: Abbrev Number: 0
 <1><913>: Abbrev Number: 12 (DW_TAG_array_type)
    <914>   DW_AT_type        : <0x6da>
    <918>   DW_AT_sibling     : <0x923>
 <2><91c>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <91d>   DW_AT_type        : <0x30>
    <921>   DW_AT_upper_bound : 7
 <2><922>: Abbrev Number: 0
 <1><923>: Abbrev Number: 17 (DW_TAG_structure_type)
    <924>   DW_AT_name        : (indirect string, offset: 0xad5d9): __locale_t
    <928>   DW_AT_declaration : 1
 <1><928>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <929>   DW_AT_byte_size   : 4
    <92a>   DW_AT_type        : <0x923>
 <1><92e>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <92f>   DW_AT_byte_size   : 4
    <930>   DW_AT_type        : <0x81d>
 <1><934>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <935>   DW_AT_prototyped  : 1
    <935>   DW_AT_sibling     : <0x93f>
 <2><939>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <93a>   DW_AT_type        : <0x568>
 <2><93e>: Abbrev Number: 0
 <1><93f>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <940>   DW_AT_byte_size   : 4
    <941>   DW_AT_type        : <0x934>
 <1><945>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <946>   DW_AT_byte_size   : 4
    <947>   DW_AT_type        : <0x7c6>
 <1><94b>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <94c>   DW_AT_byte_size   : 4
    <94d>   DW_AT_type        : <0x242>
 <1><951>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <952>   DW_AT_prototyped  : 1
    <952>   DW_AT_sibling     : <0x95c>
 <2><956>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <957>   DW_AT_type        : <0x29>
 <2><95b>: Abbrev Number: 0
 <1><95c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <95d>   DW_AT_byte_size   : 4
    <95e>   DW_AT_type        : <0x962>
 <1><962>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <963>   DW_AT_byte_size   : 4
    <964>   DW_AT_type        : <0x951>
 <1><968>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <969>   DW_AT_byte_size   : 4
    <96a>   DW_AT_type        : <0x86a>
 <1><96e>: Abbrev Number: 29 (DW_TAG_variable)
    <96f>   DW_AT_name        : (indirect string, offset: 0x61429): __sf_fake_stdin
    <973>   DW_AT_decl_file   : 7
    <974>   DW_AT_decl_line   : 463
    <976>   DW_AT_decl_column : 34
    <977>   DW_AT_type        : <0x420>
    <97b>   DW_AT_external    : 1
    <97b>   DW_AT_declaration : 1
 <1><97b>: Abbrev Number: 29 (DW_TAG_variable)
    <97c>   DW_AT_name        : (indirect string, offset: 0xc8e1b): __sf_fake_stdout
    <980>   DW_AT_decl_file   : 7
    <981>   DW_AT_decl_line   : 464
    <983>   DW_AT_decl_column : 34
    <984>   DW_AT_type        : <0x420>
    <988>   DW_AT_external    : 1
    <988>   DW_AT_declaration : 1
 <1><988>: Abbrev Number: 29 (DW_TAG_variable)
    <989>   DW_AT_name        : (indirect string, offset: 0xc83c2): __sf_fake_stderr
    <98d>   DW_AT_decl_file   : 7
    <98e>   DW_AT_decl_line   : 465
    <990>   DW_AT_decl_column : 34
    <991>   DW_AT_type        : <0x420>
    <995>   DW_AT_external    : 1
    <995>   DW_AT_declaration : 1
 <1><995>: Abbrev Number: 29 (DW_TAG_variable)
    <996>   DW_AT_name        : (indirect string, offset: 0x2f6ee): _impure_ptr
    <99a>   DW_AT_decl_file   : 7
    <99b>   DW_AT_decl_line   : 819
    <99d>   DW_AT_decl_column : 23
    <99e>   DW_AT_type        : <0x568>
    <9a2>   DW_AT_external    : 1
    <9a2>   DW_AT_declaration : 1
 <1><9a2>: Abbrev Number: 29 (DW_TAG_variable)
    <9a3>   DW_AT_name        : (indirect string, offset: 0x36180): _global_impure_ptr
    <9a7>   DW_AT_decl_file   : 7
    <9a8>   DW_AT_decl_line   : 820
    <9aa>   DW_AT_decl_column : 29
    <9ab>   DW_AT_type        : <0x56e>
    <9af>   DW_AT_external    : 1
    <9af>   DW_AT_declaration : 1
 <1><9af>: Abbrev Number: 29 (DW_TAG_variable)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x3b89): _global_atexit
    <9b4>   DW_AT_decl_file   : 7
    <9b5>   DW_AT_decl_line   : 838
    <9b7>   DW_AT_decl_column : 24
    <9b8>   DW_AT_type        : <0x35c>
    <9bc>   DW_AT_external    : 1
    <9bc>   DW_AT_declaration : 1
 <1><9bc>: Abbrev Number: 23 (DW_TAG_structure_type)
    <9bd>   DW_AT_name        : (indirect string, offset: 0xa9208): xSTATIC_LIST_ITEM
    <9c1>   DW_AT_byte_size   : 20
    <9c2>   DW_AT_decl_file   : 10
    <9c3>   DW_AT_decl_line   : 1061
    <9c5>   DW_AT_decl_column : 8
    <9c6>   DW_AT_sibling     : <0x9e7>
 <2><9ca>: Abbrev Number: 24 (DW_TAG_member)
    <9cb>   DW_AT_name        : (indirect string, offset: 0xd4d3e): xDummy2
    <9cf>   DW_AT_decl_file   : 10
    <9d0>   DW_AT_decl_line   : 1066
    <9d2>   DW_AT_decl_column : 13
    <9d3>   DW_AT_type        : <0x110>
    <9d7>   DW_AT_data_member_location: 0
 <2><9d8>: Abbrev Number: 24 (DW_TAG_member)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x492c7): pvDummy3
    <9dd>   DW_AT_decl_file   : 10
    <9de>   DW_AT_decl_line   : 1067
    <9e0>   DW_AT_decl_column : 8
    <9e1>   DW_AT_type        : <0x9e7>
    <9e5>   DW_AT_data_member_location: 4
 <2><9e6>: Abbrev Number: 0
 <1><9e7>: Abbrev Number: 12 (DW_TAG_array_type)
    <9e8>   DW_AT_type        : <0xf6>
    <9ec>   DW_AT_sibling     : <0x9f7>
 <2><9f0>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <9f1>   DW_AT_type        : <0x30>
    <9f5>   DW_AT_upper_bound : 3
 <2><9f6>: Abbrev Number: 0
 <1><9f7>: Abbrev Number: 9 (DW_TAG_typedef)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x98bcc): StaticListItem_t
    <9fc>   DW_AT_decl_file   : 10
    <9fd>   DW_AT_decl_line   : 1072
    <9ff>   DW_AT_decl_column : 34
    <a00>   DW_AT_type        : <0x9bc>
 <1><a04>: Abbrev Number: 23 (DW_TAG_structure_type)
    <a05>   DW_AT_name        : (indirect string, offset: 0x608bd): xSTATIC_TCB
    <a09>   DW_AT_byte_size   : 196
    <a0a>   DW_AT_decl_file   : 10
    <a0b>   DW_AT_decl_line   : 1112
    <a0d>   DW_AT_decl_column : 16
    <a0e>   DW_AT_sibling     : <0xa9f>
 <2><a12>: Abbrev Number: 24 (DW_TAG_member)
    <a13>   DW_AT_name        : (indirect string, offset: 0x28de7): pxDummy1
    <a17>   DW_AT_decl_file   : 10
    <a18>   DW_AT_decl_line   : 1114
    <a1a>   DW_AT_decl_column : 11
    <a1b>   DW_AT_type        : <0xf6>
    <a1f>   DW_AT_data_member_location: 0
 <2><a20>: Abbrev Number: 24 (DW_TAG_member)
    <a21>   DW_AT_name        : (indirect string, offset: 0x2678c): xDummy3
    <a25>   DW_AT_decl_file   : 10
    <a26>   DW_AT_decl_line   : 1118
    <a28>   DW_AT_decl_column : 19
    <a29>   DW_AT_type        : <0xa9f>
    <a2d>   DW_AT_data_member_location: 4
 <2><a2e>: Abbrev Number: 24 (DW_TAG_member)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x1bf4b): uxDummy5
    <a33>   DW_AT_decl_file   : 10
    <a34>   DW_AT_decl_line   : 1119
    <a36>   DW_AT_decl_column : 16
    <a37>   DW_AT_type        : <0x104>
    <a3b>   DW_AT_data_member_location: 44
 <2><a3c>: Abbrev Number: 24 (DW_TAG_member)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x28ea0): pxDummy6
    <a41>   DW_AT_decl_file   : 10
    <a42>   DW_AT_decl_line   : 1120
    <a44>   DW_AT_decl_column : 11
    <a45>   DW_AT_type        : <0xf6>
    <a49>   DW_AT_data_member_location: 48
 <2><a4a>: Abbrev Number: 24 (DW_TAG_member)
    <a4b>   DW_AT_name        : (indirect string, offset: 0x47757): ucDummy7
    <a4f>   DW_AT_decl_file   : 10
    <a50>   DW_AT_decl_line   : 1121
    <a52>   DW_AT_decl_column : 13
    <a53>   DW_AT_type        : <0xaaf>
    <a57>   DW_AT_data_member_location: 52
 <2><a58>: Abbrev Number: 24 (DW_TAG_member)
    <a59>   DW_AT_name        : (indirect string, offset: 0x2c1e1): uxDummy12
    <a5d>   DW_AT_decl_file   : 10
    <a5e>   DW_AT_decl_line   : 1132
    <a60>   DW_AT_decl_column : 16
    <a61>   DW_AT_type        : <0xabf>
    <a65>   DW_AT_data_member_location: 84
 <2><a66>: Abbrev Number: 24 (DW_TAG_member)
    <a67>   DW_AT_name        : (indirect string, offset: 0xa18d7): xDummy17
    <a6b>   DW_AT_decl_file   : 10
    <a6c>   DW_AT_decl_line   : 1144
    <a6e>   DW_AT_decl_column : 17
    <a6f>   DW_AT_type        : <0x425>
    <a73>   DW_AT_data_member_location: 92
 <2><a74>: Abbrev Number: 24 (DW_TAG_member)
    <a75>   DW_AT_name        : (indirect string, offset: 0x1d3be): ulDummy18
    <a79>   DW_AT_decl_file   : 10
    <a7a>   DW_AT_decl_line   : 1147
    <a7c>   DW_AT_decl_column : 14
    <a7d>   DW_AT_type        : <0xd4>
    <a81>   DW_AT_data_member_location: 188
 <2><a82>: Abbrev Number: 24 (DW_TAG_member)
    <a83>   DW_AT_name        : (indirect string, offset: 0x3d30d): ucDummy19
    <a87>   DW_AT_decl_file   : 10
    <a88>   DW_AT_decl_line   : 1148
    <a8a>   DW_AT_decl_column : 13
    <a8b>   DW_AT_type        : <0xa6>
    <a8f>   DW_AT_data_member_location: 192
 <2><a90>: Abbrev Number: 24 (DW_TAG_member)
    <a91>   DW_AT_name        : (indirect string, offset: 0xb67ac): uxDummy20
    <a95>   DW_AT_decl_file   : 10
    <a96>   DW_AT_decl_line   : 1151
    <a98>   DW_AT_decl_column : 13
    <a99>   DW_AT_type        : <0xa6>
    <a9d>   DW_AT_data_member_location: 193
 <2><a9e>: Abbrev Number: 0
 <1><a9f>: Abbrev Number: 12 (DW_TAG_array_type)
    <aa0>   DW_AT_type        : <0x9f7>
    <aa4>   DW_AT_sibling     : <0xaaf>
 <2><aa8>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <aa9>   DW_AT_type        : <0x30>
    <aad>   DW_AT_upper_bound : 1
 <2><aae>: Abbrev Number: 0
 <1><aaf>: Abbrev Number: 12 (DW_TAG_array_type)
    <ab0>   DW_AT_type        : <0xa6>
    <ab4>   DW_AT_sibling     : <0xabf>
 <2><ab8>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ab9>   DW_AT_type        : <0x30>
    <abd>   DW_AT_upper_bound : 31
 <2><abe>: Abbrev Number: 0
 <1><abf>: Abbrev Number: 12 (DW_TAG_array_type)
    <ac0>   DW_AT_type        : <0x104>
    <ac4>   DW_AT_sibling     : <0xacf>
 <2><ac8>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ac9>   DW_AT_type        : <0x30>
    <acd>   DW_AT_upper_bound : 1
 <2><ace>: Abbrev Number: 0
 <1><acf>: Abbrev Number: 9 (DW_TAG_typedef)
    <ad0>   DW_AT_name        : (indirect string, offset: 0x64cb6): StaticTask_t
    <ad4>   DW_AT_decl_file   : 10
    <ad5>   DW_AT_decl_line   : 1160
    <ad7>   DW_AT_decl_column : 3
    <ad8>   DW_AT_type        : <0xa04>
 <1><adc>: Abbrev Number: 4 (DW_TAG_typedef)
    <add>   DW_AT_name        : (indirect string, offset: 0xafb01): TaskHandle_t
    <ae1>   DW_AT_decl_file   : 11
    <ae2>   DW_AT_decl_line   : 70
    <ae3>   DW_AT_decl_column : 37
    <ae4>   DW_AT_type        : <0xae8>
 <1><ae8>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <ae9>   DW_AT_byte_size   : 4
    <aea>   DW_AT_type        : <0xaee>
 <1><aee>: Abbrev Number: 17 (DW_TAG_structure_type)
    <aef>   DW_AT_name        : (indirect string, offset: 0xabfc0): tskTaskControlBlock
    <af3>   DW_AT_declaration : 1
 <1><af3>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <af4>   DW_AT_byte_size   : 4
    <af5>   DW_AT_type        : <0xf8>
 <1><af9>: Abbrev Number: 29 (DW_TAG_variable)
    <afa>   DW_AT_name        : (indirect string, offset: 0x4722): ITM_RxBuffer
    <afe>   DW_AT_decl_file   : 12
    <aff>   DW_AT_decl_line   : 2047
    <b01>   DW_AT_decl_column : 25
    <b02>   DW_AT_type        : <0xcf>
    <b06>   DW_AT_external    : 1
    <b06>   DW_AT_declaration : 1
 <1><b06>: Abbrev Number: 12 (DW_TAG_array_type)
    <b07>   DW_AT_type        : <0xb2>
    <b0b>   DW_AT_sibling     : <0xb16>
 <2><b0f>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <b10>   DW_AT_type        : <0x30>
    <b14>   DW_AT_upper_bound : 15
 <2><b15>: Abbrev Number: 0
 <1><b16>: Abbrev Number: 5 (DW_TAG_const_type)
    <b17>   DW_AT_type        : <0xb06>
 <1><b1b>: Abbrev Number: 7 (DW_TAG_variable)
    <b1c>   DW_AT_name        : (indirect string, offset: 0xb6e17): AHBPrescTable
    <b20>   DW_AT_decl_file   : 13
    <b21>   DW_AT_decl_line   : 60
    <b22>   DW_AT_decl_column : 23
    <b23>   DW_AT_type        : <0xb16>
    <b27>   DW_AT_external    : 1
    <b27>   DW_AT_declaration : 1
 <1><b27>: Abbrev Number: 12 (DW_TAG_array_type)
    <b28>   DW_AT_type        : <0xb2>
    <b2c>   DW_AT_sibling     : <0xb37>
 <2><b30>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <b31>   DW_AT_type        : <0x30>
    <b35>   DW_AT_upper_bound : 7
 <2><b36>: Abbrev Number: 0
 <1><b37>: Abbrev Number: 5 (DW_TAG_const_type)
    <b38>   DW_AT_type        : <0xb27>
 <1><b3c>: Abbrev Number: 7 (DW_TAG_variable)
    <b3d>   DW_AT_name        : (indirect string, offset: 0x82437): APBPrescTable
    <b41>   DW_AT_decl_file   : 13
    <b42>   DW_AT_decl_line   : 61
    <b43>   DW_AT_decl_column : 23
    <b44>   DW_AT_type        : <0xb37>
    <b48>   DW_AT_external    : 1
    <b48>   DW_AT_declaration : 1
 <1><b48>: Abbrev Number: 12 (DW_TAG_array_type)
    <b49>   DW_AT_type        : <0xe5>
    <b4d>   DW_AT_sibling     : <0xb58>
 <2><b51>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <b52>   DW_AT_type        : <0x30>
    <b56>   DW_AT_upper_bound : 11
 <2><b57>: Abbrev Number: 0
 <1><b58>: Abbrev Number: 5 (DW_TAG_const_type)
    <b59>   DW_AT_type        : <0xb48>
 <1><b5d>: Abbrev Number: 7 (DW_TAG_variable)
    <b5e>   DW_AT_name        : (indirect string, offset: 0x8c636): MSIRangeTable
    <b62>   DW_AT_decl_file   : 13
    <b63>   DW_AT_decl_line   : 62
    <b64>   DW_AT_decl_column : 23
    <b65>   DW_AT_type        : <0xb58>
    <b69>   DW_AT_external    : 1
    <b69>   DW_AT_declaration : 1
 <1><b69>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <b6a>   DW_AT_encoding    : 7	(unsigned)
    <b6b>   DW_AT_byte_size   : 1
    <b6c>   DW_AT_type        : <0x58>
    <b70>   DW_AT_decl_file   : 14
    <b71>   DW_AT_decl_line   : 51
    <b72>   DW_AT_decl_column : 1
    <b73>   DW_AT_sibling     : <0xb84>
 <2><b77>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b78>   DW_AT_name        : (indirect string, offset: 0x95936): HAL_UNLOCKED
    <b7c>   DW_AT_const_value : 0
 <2><b7d>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b7e>   DW_AT_name        : (indirect string, offset: 0xc9a5a): HAL_LOCKED
    <b82>   DW_AT_const_value : 1
 <2><b83>: Abbrev Number: 0
 <1><b84>: Abbrev Number: 4 (DW_TAG_typedef)
    <b85>   DW_AT_name        : (indirect string, offset: 0x77834): HAL_LockTypeDef
    <b89>   DW_AT_decl_file   : 14
    <b8a>   DW_AT_decl_line   : 54
    <b8b>   DW_AT_decl_column : 3
    <b8c>   DW_AT_type        : <0xb69>
 <1><b90>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <b91>   DW_AT_encoding    : 7	(unsigned)
    <b92>   DW_AT_byte_size   : 1
    <b93>   DW_AT_type        : <0x58>
    <b97>   DW_AT_decl_file   : 15
    <b98>   DW_AT_decl_line   : 102
    <b99>   DW_AT_decl_column : 1
    <b9a>   DW_AT_sibling     : <0xbbd>
 <2><b9e>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b9f>   DW_AT_name        : (indirect string, offset: 0x7540c): FLASH_PROC_NONE
    <ba3>   DW_AT_const_value : 0
 <2><ba4>: Abbrev Number: 31 (DW_TAG_enumerator)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x613a): FLASH_PROC_PAGE_ERASE
    <ba9>   DW_AT_const_value : 1
 <2><baa>: Abbrev Number: 31 (DW_TAG_enumerator)
    <bab>   DW_AT_name        : (indirect string, offset: 0x609bf): FLASH_PROC_MASS_ERASE
    <baf>   DW_AT_const_value : 2
 <2><bb0>: Abbrev Number: 31 (DW_TAG_enumerator)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x1d7bb): FLASH_PROC_PROGRAM
    <bb5>   DW_AT_const_value : 3
 <2><bb6>: Abbrev Number: 31 (DW_TAG_enumerator)
    <bb7>   DW_AT_name        : (indirect string, offset: 0x4c4d3): FLASH_PROC_PROGRAM_LAST
    <bbb>   DW_AT_const_value : 4
 <2><bbc>: Abbrev Number: 0
 <1><bbd>: Abbrev Number: 4 (DW_TAG_typedef)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x37283): FLASH_ProcedureTypeDef
    <bc2>   DW_AT_decl_file   : 15
    <bc3>   DW_AT_decl_line   : 108
    <bc4>   DW_AT_decl_column : 3
    <bc5>   DW_AT_type        : <0xb90>
 <1><bc9>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <bca>   DW_AT_type        : <0xbbd>
 <1><bce>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <bcf>   DW_AT_encoding    : 7	(unsigned)
    <bd0>   DW_AT_byte_size   : 1
    <bd1>   DW_AT_type        : <0x58>
    <bd5>   DW_AT_decl_file   : 15
    <bd6>   DW_AT_decl_line   : 114
    <bd7>   DW_AT_decl_column : 1
    <bd8>   DW_AT_sibling     : <0xbf5>
 <2><bdc>: Abbrev Number: 31 (DW_TAG_enumerator)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x11da9): FLASH_CACHE_DISABLED
    <be1>   DW_AT_const_value : 0
 <2><be2>: Abbrev Number: 31 (DW_TAG_enumerator)
    <be3>   DW_AT_name        : (indirect string, offset: 0x49926): FLASH_CACHE_ICACHE_ENABLED
    <be7>   DW_AT_const_value : 1
 <2><be8>: Abbrev Number: 31 (DW_TAG_enumerator)
    <be9>   DW_AT_name        : (indirect string, offset: 0xa6dc6): FLASH_CACHE_DCACHE_ENABLED
    <bed>   DW_AT_const_value : 2
 <2><bee>: Abbrev Number: 31 (DW_TAG_enumerator)
    <bef>   DW_AT_name        : (indirect string, offset: 0xa5530): FLASH_CACHE_ICACHE_DCACHE_ENABLED
    <bf3>   DW_AT_const_value : 3
 <2><bf4>: Abbrev Number: 0
 <1><bf5>: Abbrev Number: 4 (DW_TAG_typedef)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x86b75): FLASH_CacheTypeDef
    <bfa>   DW_AT_decl_file   : 15
    <bfb>   DW_AT_decl_line   : 119
    <bfc>   DW_AT_decl_column : 3
    <bfd>   DW_AT_type        : <0xbce>
 <1><c01>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <c02>   DW_AT_type        : <0xbf5>
 <1><c06>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c07>   DW_AT_byte_size   : 32
    <c08>   DW_AT_decl_file   : 15
    <c09>   DW_AT_decl_line   : 124
    <c0a>   DW_AT_decl_column : 9
    <c0b>   DW_AT_sibling     : <0xc78>
 <2><c0f>: Abbrev Number: 15 (DW_TAG_member)
    <c10>   DW_AT_name        : (indirect string, offset: 0x905ee): Lock
    <c14>   DW_AT_decl_file   : 15
    <c15>   DW_AT_decl_line   : 126
    <c16>   DW_AT_decl_column : 31
    <c17>   DW_AT_type        : <0xb84>
    <c1b>   DW_AT_data_member_location: 0
 <2><c1c>: Abbrev Number: 15 (DW_TAG_member)
    <c1d>   DW_AT_name        : (indirect string, offset: 0xc57eb): ErrorCode
    <c21>   DW_AT_decl_file   : 15
    <c22>   DW_AT_decl_line   : 127
    <c23>   DW_AT_decl_column : 31
    <c24>   DW_AT_type        : <0xe0>
    <c28>   DW_AT_data_member_location: 4
 <2><c29>: Abbrev Number: 15 (DW_TAG_member)
    <c2a>   DW_AT_name        : (indirect string, offset: 0x663c9): ProcedureOnGoing
    <c2e>   DW_AT_decl_file   : 15
    <c2f>   DW_AT_decl_line   : 128
    <c30>   DW_AT_decl_column : 31
    <c31>   DW_AT_type        : <0xbc9>
    <c35>   DW_AT_data_member_location: 8
 <2><c36>: Abbrev Number: 15 (DW_TAG_member)
    <c37>   DW_AT_name        : (indirect string, offset: 0xcbe03): Address
    <c3b>   DW_AT_decl_file   : 15
    <c3c>   DW_AT_decl_line   : 129
    <c3d>   DW_AT_decl_column : 31
    <c3e>   DW_AT_type        : <0xe0>
    <c42>   DW_AT_data_member_location: 12
 <2><c43>: Abbrev Number: 15 (DW_TAG_member)
    <c44>   DW_AT_name        : (indirect string, offset: 0xd16a8): Bank
    <c48>   DW_AT_decl_file   : 15
    <c49>   DW_AT_decl_line   : 130
    <c4a>   DW_AT_decl_column : 31
    <c4b>   DW_AT_type        : <0xe0>
    <c4f>   DW_AT_data_member_location: 16
 <2><c50>: Abbrev Number: 15 (DW_TAG_member)
    <c51>   DW_AT_name        : (indirect string, offset: 0x9a5d1): Page
    <c55>   DW_AT_decl_file   : 15
    <c56>   DW_AT_decl_line   : 131
    <c57>   DW_AT_decl_column : 31
    <c58>   DW_AT_type        : <0xe0>
    <c5c>   DW_AT_data_member_location: 20
 <2><c5d>: Abbrev Number: 15 (DW_TAG_member)
    <c5e>   DW_AT_name        : (indirect string, offset: 0x29d9c): NbPagesToErase
    <c62>   DW_AT_decl_file   : 15
    <c63>   DW_AT_decl_line   : 132
    <c64>   DW_AT_decl_column : 31
    <c65>   DW_AT_type        : <0xe0>
    <c69>   DW_AT_data_member_location: 24
 <2><c6a>: Abbrev Number: 15 (DW_TAG_member)
    <c6b>   DW_AT_name        : (indirect string, offset: 0xc4021): CacheToReactivate
    <c6f>   DW_AT_decl_file   : 15
    <c70>   DW_AT_decl_line   : 133
    <c71>   DW_AT_decl_column : 31
    <c72>   DW_AT_type        : <0xc01>
    <c76>   DW_AT_data_member_location: 28
 <2><c77>: Abbrev Number: 0
 <1><c78>: Abbrev Number: 4 (DW_TAG_typedef)
    <c79>   DW_AT_name        : (indirect string, offset: 0x3c689): FLASH_ProcessTypeDef
    <c7d>   DW_AT_decl_file   : 15
    <c7e>   DW_AT_decl_line   : 134
    <c7f>   DW_AT_decl_column : 2
    <c80>   DW_AT_type        : <0xc06>
 <1><c84>: Abbrev Number: 29 (DW_TAG_variable)
    <c85>   DW_AT_name        : (indirect string, offset: 0x90e6d): pFlash
    <c89>   DW_AT_decl_file   : 15
    <c8a>   DW_AT_decl_line   : 826
    <c8c>   DW_AT_decl_column : 29
    <c8d>   DW_AT_type        : <0xc78>
    <c91>   DW_AT_external    : 1
    <c91>   DW_AT_declaration : 1
 <1><c91>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <c92>   DW_AT_encoding    : 7	(unsigned)
    <c93>   DW_AT_byte_size   : 1
    <c94>   DW_AT_type        : <0x58>
    <c98>   DW_AT_decl_file   : 16
    <c99>   DW_AT_decl_line   : 49
    <c9a>   DW_AT_decl_column : 1
    <c9b>   DW_AT_sibling     : <0xcb8>
 <2><c9f>: Abbrev Number: 31 (DW_TAG_enumerator)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x6887c): HAL_TICK_FREQ_10HZ
    <ca4>   DW_AT_const_value : 100
 <2><ca5>: Abbrev Number: 31 (DW_TAG_enumerator)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x4af48): HAL_TICK_FREQ_100HZ
    <caa>   DW_AT_const_value : 10
 <2><cab>: Abbrev Number: 31 (DW_TAG_enumerator)
    <cac>   DW_AT_name        : (indirect string, offset: 0x5efec): HAL_TICK_FREQ_1KHZ
    <cb0>   DW_AT_const_value : 1
 <2><cb1>: Abbrev Number: 31 (DW_TAG_enumerator)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x48df8): HAL_TICK_FREQ_DEFAULT
    <cb6>   DW_AT_const_value : 1
 <2><cb7>: Abbrev Number: 0
 <1><cb8>: Abbrev Number: 4 (DW_TAG_typedef)
    <cb9>   DW_AT_name        : (indirect string, offset: 0x9fa75): HAL_TickFreqTypeDef
    <cbd>   DW_AT_decl_file   : 16
    <cbe>   DW_AT_decl_line   : 54
    <cbf>   DW_AT_decl_column : 3
    <cc0>   DW_AT_type        : <0xc91>
 <1><cc4>: Abbrev Number: 29 (DW_TAG_variable)
    <cc5>   DW_AT_name        : (indirect string, offset: 0x2e597): uwTick
    <cc9>   DW_AT_decl_file   : 16
    <cca>   DW_AT_decl_line   : 619
    <ccc>   DW_AT_decl_column : 22
    <ccd>   DW_AT_type        : <0xe0>
    <cd1>   DW_AT_external    : 1
    <cd1>   DW_AT_declaration : 1
 <1><cd1>: Abbrev Number: 29 (DW_TAG_variable)
    <cd2>   DW_AT_name        : (indirect string, offset: 0x97bf6): uwTickPrio
    <cd6>   DW_AT_decl_file   : 16
    <cd7>   DW_AT_decl_line   : 620
    <cd9>   DW_AT_decl_column : 17
    <cda>   DW_AT_type        : <0xd4>
    <cde>   DW_AT_external    : 1
    <cde>   DW_AT_declaration : 1
 <1><cde>: Abbrev Number: 29 (DW_TAG_variable)
    <cdf>   DW_AT_name        : (indirect string, offset: 0xb67ce): uwTickFreq
    <ce3>   DW_AT_decl_file   : 16
    <ce4>   DW_AT_decl_line   : 621
    <ce6>   DW_AT_decl_column : 28
    <ce7>   DW_AT_type        : <0xcb8>
    <ceb>   DW_AT_external    : 1
    <ceb>   DW_AT_declaration : 1
 <1><ceb>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <cec>   DW_AT_encoding    : 5	(signed)
    <ced>   DW_AT_byte_size   : 2
    <cee>   DW_AT_type        : <0x5f>
    <cf2>   DW_AT_decl_file   : 17
    <cf3>   DW_AT_decl_line   : 172
    <cf4>   DW_AT_decl_column : 15
    <cf5>   DW_AT_sibling     : <0xd2a>
 <2><cf9>: Abbrev Number: 32 (DW_TAG_enumerator)
    <cfa>   DW_AT_name        : (indirect string, offset: 0xaf579): osPriorityIdle
    <cfe>   DW_AT_const_value : -3
 <2><cff>: Abbrev Number: 32 (DW_TAG_enumerator)
    <d00>   DW_AT_name        : (indirect string, offset: 0xb9db1): osPriorityLow
    <d04>   DW_AT_const_value : -2
 <2><d05>: Abbrev Number: 32 (DW_TAG_enumerator)
    <d06>   DW_AT_name        : (indirect string, offset: 0xc1fb8): osPriorityBelowNormal
    <d0a>   DW_AT_const_value : -1
 <2><d0b>: Abbrev Number: 31 (DW_TAG_enumerator)
    <d0c>   DW_AT_name        : (indirect string, offset: 0xa4c87): osPriorityNormal
    <d10>   DW_AT_const_value : 0
 <2><d11>: Abbrev Number: 31 (DW_TAG_enumerator)
    <d12>   DW_AT_name        : (indirect string, offset: 0x82529): osPriorityAboveNormal
    <d16>   DW_AT_const_value : 1
 <2><d17>: Abbrev Number: 31 (DW_TAG_enumerator)
    <d18>   DW_AT_name        : (indirect string, offset: 0x482b2): osPriorityHigh
    <d1c>   DW_AT_const_value : 2
 <2><d1d>: Abbrev Number: 31 (DW_TAG_enumerator)
    <d1e>   DW_AT_name        : (indirect string, offset: 0xb6d65): osPriorityRealtime
    <d22>   DW_AT_const_value : 3
 <2><d23>: Abbrev Number: 31 (DW_TAG_enumerator)
    <d24>   DW_AT_name        : (indirect string, offset: 0xb232c): osPriorityError
    <d28>   DW_AT_const_value : 132
 <2><d29>: Abbrev Number: 0
 <1><d2a>: Abbrev Number: 4 (DW_TAG_typedef)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x7876d): osPriority
    <d2f>   DW_AT_decl_file   : 17
    <d30>   DW_AT_decl_line   : 181
    <d31>   DW_AT_decl_column : 3
    <d32>   DW_AT_type        : <0xceb>
 <1><d36>: Abbrev Number: 4 (DW_TAG_typedef)
    <d37>   DW_AT_name        : (indirect string, offset: 0x641e7): os_pthread
    <d3b>   DW_AT_decl_file   : 17
    <d3c>   DW_AT_decl_line   : 228
    <d3d>   DW_AT_decl_column : 16
    <d3e>   DW_AT_type        : <0xd42>
 <1><d42>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <d43>   DW_AT_byte_size   : 4
    <d44>   DW_AT_type        : <0xd48>
 <1><d48>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <d49>   DW_AT_prototyped  : 1
    <d49>   DW_AT_sibling     : <0xd53>
 <2><d4d>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <d4e>   DW_AT_type        : <0xd53>
 <2><d52>: Abbrev Number: 0
 <1><d53>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <d54>   DW_AT_byte_size   : 4
    <d55>   DW_AT_type        : <0xd59>
 <1><d59>: Abbrev Number: 33 (DW_TAG_const_type)
 <1><d5a>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5b>   DW_AT_name        : (indirect string, offset: 0x11fbb): osThreadId
    <d5f>   DW_AT_decl_file   : 17
    <d60>   DW_AT_decl_line   : 238
    <d61>   DW_AT_decl_column : 22
    <d62>   DW_AT_type        : <0xadc>
 <1><d66>: Abbrev Number: 9 (DW_TAG_typedef)
    <d67>   DW_AT_name        : (indirect string, offset: 0x7ebd0): osStaticThreadDef_t
    <d6b>   DW_AT_decl_file   : 17
    <d6c>   DW_AT_decl_line   : 267
    <d6e>   DW_AT_decl_column : 36
    <d6f>   DW_AT_type        : <0xacf>
 <1><d73>: Abbrev Number: 23 (DW_TAG_structure_type)
    <d74>   DW_AT_name        : (indirect string, offset: 0x3553): os_thread_def
    <d78>   DW_AT_byte_size   : 28
    <d79>   DW_AT_decl_file   : 17
    <d7a>   DW_AT_decl_line   : 280
    <d7c>   DW_AT_decl_column : 16
    <d7d>   DW_AT_sibling     : <0xde4>
 <2><d81>: Abbrev Number: 24 (DW_TAG_member)
    <d82>   DW_AT_name        : (indirect string, offset: 0x17d6e): name
    <d86>   DW_AT_decl_file   : 17
    <d87>   DW_AT_decl_line   : 281
    <d89>   DW_AT_decl_column : 27
    <d8a>   DW_AT_type        : <0x6d4>
    <d8e>   DW_AT_data_member_location: 0
 <2><d8f>: Abbrev Number: 24 (DW_TAG_member)
    <d90>   DW_AT_name        : (indirect string, offset: 0x641ea): pthread
    <d94>   DW_AT_decl_file   : 17
    <d95>   DW_AT_decl_line   : 282
    <d97>   DW_AT_decl_column : 26
    <d98>   DW_AT_type        : <0xd36>
    <d9c>   DW_AT_data_member_location: 4
 <2><d9d>: Abbrev Number: 24 (DW_TAG_member)
    <d9e>   DW_AT_name        : (indirect string, offset: 0x928f7): tpriority
    <da2>   DW_AT_decl_file   : 17
    <da3>   DW_AT_decl_line   : 283
    <da5>   DW_AT_decl_column : 26
    <da6>   DW_AT_type        : <0xd2a>
    <daa>   DW_AT_data_member_location: 8
 <2><dab>: Abbrev Number: 24 (DW_TAG_member)
    <dac>   DW_AT_name        : (indirect string, offset: 0x6e06a): instances
    <db0>   DW_AT_decl_file   : 17
    <db1>   DW_AT_decl_line   : 284
    <db3>   DW_AT_decl_column : 26
    <db4>   DW_AT_type        : <0xd4>
    <db8>   DW_AT_data_member_location: 12
 <2><db9>: Abbrev Number: 24 (DW_TAG_member)
    <dba>   DW_AT_name        : (indirect string, offset: 0x10061): stacksize
    <dbe>   DW_AT_decl_file   : 17
    <dbf>   DW_AT_decl_line   : 285
    <dc1>   DW_AT_decl_column : 26
    <dc2>   DW_AT_type        : <0xd4>
    <dc6>   DW_AT_data_member_location: 16
 <2><dc7>: Abbrev Number: 24 (DW_TAG_member)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x1eac8): buffer
    <dcc>   DW_AT_decl_file   : 17
    <dcd>   DW_AT_decl_line   : 287
    <dcf>   DW_AT_decl_column : 27
    <dd0>   DW_AT_type        : <0xde4>
    <dd4>   DW_AT_data_member_location: 20
 <2><dd5>: Abbrev Number: 24 (DW_TAG_member)
    <dd6>   DW_AT_name        : (indirect string, offset: 0x5c611): controlblock
    <dda>   DW_AT_decl_file   : 17
    <ddb>   DW_AT_decl_line   : 288
    <ddd>   DW_AT_decl_column : 27
    <dde>   DW_AT_type        : <0xdea>
    <de2>   DW_AT_data_member_location: 24
 <2><de3>: Abbrev Number: 0
 <1><de4>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <de5>   DW_AT_byte_size   : 4
    <de6>   DW_AT_type        : <0xd4>
 <1><dea>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <deb>   DW_AT_byte_size   : 4
    <dec>   DW_AT_type        : <0xd66>
 <1><df0>: Abbrev Number: 9 (DW_TAG_typedef)
    <df1>   DW_AT_name        : (indirect string, offset: 0xfa57): osThreadDef_t
    <df5>   DW_AT_decl_file   : 17
    <df6>   DW_AT_decl_line   : 290
    <df8>   DW_AT_decl_column : 3
    <df9>   DW_AT_type        : <0xd73>
 <1><dfd>: Abbrev Number: 5 (DW_TAG_const_type)
    <dfe>   DW_AT_type        : <0xdf0>
 <1><e02>: Abbrev Number: 34 (DW_TAG_variable)
    <e03>   DW_AT_name        : (indirect string, offset: 0x50a51): defaultTaskHandle
    <e07>   DW_AT_decl_file   : 1
    <e08>   DW_AT_decl_line   : 51
    <e09>   DW_AT_decl_column : 12
    <e0a>   DW_AT_type        : <0xd5a>
    <e0e>   DW_AT_external    : 1
    <e0e>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e14>: Abbrev Number: 35 (DW_TAG_variable)
    <e15>   DW_AT_name        : (indirect string, offset: 0x6b801): xIdleTaskTCBBuffer
    <e19>   DW_AT_decl_file   : 1
    <e1a>   DW_AT_decl_line   : 126
    <e1b>   DW_AT_decl_column : 21
    <e1c>   DW_AT_type        : <0xacf>
    <e20>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><e26>: Abbrev Number: 12 (DW_TAG_array_type)
    <e27>   DW_AT_type        : <0xf8>
    <e2b>   DW_AT_sibling     : <0xe36>
 <2><e2f>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <e30>   DW_AT_type        : <0x30>
    <e34>   DW_AT_upper_bound : 127
 <2><e35>: Abbrev Number: 0
 <1><e36>: Abbrev Number: 35 (DW_TAG_variable)
    <e37>   DW_AT_name        : (indirect string, offset: 0x3cb82): xIdleStack
    <e3b>   DW_AT_decl_file   : 1
    <e3c>   DW_AT_decl_line   : 127
    <e3d>   DW_AT_decl_column : 20
    <e3e>   DW_AT_type        : <0xe26>
    <e42>   DW_AT_location    : 5 byte block: 3 54 1 0 20 	(DW_OP_addr: 20000154)
 <1><e48>: Abbrev Number: 35 (DW_TAG_variable)
    <e49>   DW_AT_name        : (indirect string, offset: 0xa388f): xTimerTaskTCBBuffer
    <e4d>   DW_AT_decl_file   : 1
    <e4e>   DW_AT_decl_line   : 139
    <e4f>   DW_AT_decl_column : 21
    <e50>   DW_AT_type        : <0xacf>
    <e54>   DW_AT_location    : 5 byte block: 3 54 3 0 20 	(DW_OP_addr: 20000354)
 <1><e5a>: Abbrev Number: 12 (DW_TAG_array_type)
    <e5b>   DW_AT_type        : <0xf8>
    <e5f>   DW_AT_sibling     : <0xe6a>
 <2><e63>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <e64>   DW_AT_type        : <0x30>
    <e68>   DW_AT_upper_bound : 255
 <2><e69>: Abbrev Number: 0
 <1><e6a>: Abbrev Number: 35 (DW_TAG_variable)
    <e6b>   DW_AT_name        : (indirect string, offset: 0xb1225): xTimerStack
    <e6f>   DW_AT_decl_file   : 1
    <e70>   DW_AT_decl_line   : 140
    <e71>   DW_AT_decl_column : 20
    <e72>   DW_AT_type        : <0xe5a>
    <e76>   DW_AT_location    : 5 byte block: 3 18 4 0 20 	(DW_OP_addr: 20000418)
 <1><e7c>: Abbrev Number: 36 (DW_TAG_subprogram)
    <e7d>   DW_AT_external    : 1
    <e7d>   DW_AT_name        : (indirect string, offset: 0x2c945): StartDefaultTask
    <e81>   DW_AT_decl_file   : 1
    <e82>   DW_AT_decl_line   : 195
    <e83>   DW_AT_decl_column : 6
    <e84>   DW_AT_prototyped  : 1
    <e84>   DW_AT_low_pc      : 0x0
    <e88>   DW_AT_high_pc     : 0x10
    <e8c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e8e>   DW_AT_GNU_all_tail_call_sites: 1
    <e8e>   DW_AT_sibling     : <0xea2>
 <2><e92>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <e93>   DW_AT_name        : (indirect string, offset: 0x2b129): argument
    <e97>   DW_AT_decl_file   : 1
    <e98>   DW_AT_decl_line   : 195
    <e99>   DW_AT_decl_column : 36
    <e9a>   DW_AT_type        : <0xd53>
    <e9e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ea1>: Abbrev Number: 0
 <1><ea2>: Abbrev Number: 36 (DW_TAG_subprogram)
    <ea3>   DW_AT_external    : 1
    <ea3>   DW_AT_name        : (indirect string, offset: 0x2ed5c): MX_FREERTOS_Init
    <ea7>   DW_AT_decl_file   : 1
    <ea8>   DW_AT_decl_line   : 156
    <ea9>   DW_AT_decl_column : 6
    <eaa>   DW_AT_prototyped  : 1
    <eaa>   DW_AT_low_pc      : 0x0
    <eae>   DW_AT_high_pc     : 0x38
    <eb2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <eb4>   DW_AT_GNU_all_tail_call_sites: 1
    <eb4>   DW_AT_sibling     : <0xec8>
 <2><eb8>: Abbrev Number: 35 (DW_TAG_variable)
    <eb9>   DW_AT_name        : (indirect string, offset: 0x98300): os_thread_def_defaultTask
    <ebd>   DW_AT_decl_file   : 1
    <ebe>   DW_AT_decl_line   : 179
    <ebf>   DW_AT_decl_column : 3
    <ec0>   DW_AT_type        : <0xdfd>
    <ec4>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><ec7>: Abbrev Number: 0
 <1><ec8>: Abbrev Number: 38 (DW_TAG_subprogram)
    <ec9>   DW_AT_external    : 1
    <ec9>   DW_AT_name        : (indirect string, offset: 0xa5dbd): vApplicationGetTimerTaskMemory
    <ecd>   DW_AT_decl_file   : 1
    <ece>   DW_AT_decl_line   : 142
    <ecf>   DW_AT_decl_column : 6
    <ed0>   DW_AT_prototyped  : 1
    <ed0>   DW_AT_low_pc      : 0x80005ec
    <ed4>   DW_AT_high_pc     : 0x34
    <ed8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <eda>   DW_AT_GNU_all_call_sites: 1
    <eda>   DW_AT_sibling     : <0xf0c>
 <2><ede>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <edf>   DW_AT_name        : (indirect string, offset: 0xa388d): ppxTimerTaskTCBBuffer
    <ee3>   DW_AT_decl_file   : 1
    <ee4>   DW_AT_decl_line   : 142
    <ee5>   DW_AT_decl_column : 53
    <ee6>   DW_AT_type        : <0xf0c>
    <eea>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><eed>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <eee>   DW_AT_name        : (indirect string, offset: 0x20b6c): ppxTimerTaskStackBuffer
    <ef2>   DW_AT_decl_file   : 1
    <ef3>   DW_AT_decl_line   : 142
    <ef4>   DW_AT_decl_column : 90
    <ef5>   DW_AT_type        : <0xf18>
    <ef9>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><efc>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <efd>   DW_AT_name        : (indirect string, offset: 0x4a6ec): pulTimerTaskStackSize
    <f01>   DW_AT_decl_file   : 1
    <f02>   DW_AT_decl_line   : 142
    <f03>   DW_AT_decl_column : 125
    <f04>   DW_AT_type        : <0xde4>
    <f08>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f0b>: Abbrev Number: 0
 <1><f0c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f0d>   DW_AT_byte_size   : 4
    <f0e>   DW_AT_type        : <0xf12>
 <1><f12>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f13>   DW_AT_byte_size   : 4
    <f14>   DW_AT_type        : <0xacf>
 <1><f18>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f19>   DW_AT_byte_size   : 4
    <f1a>   DW_AT_type        : <0xaf3>
 <1><f1e>: Abbrev Number: 38 (DW_TAG_subprogram)
    <f1f>   DW_AT_external    : 1
    <f1f>   DW_AT_name        : (indirect string, offset: 0x771f9): vApplicationGetIdleTaskMemory
    <f23>   DW_AT_decl_file   : 1
    <f24>   DW_AT_decl_line   : 129
    <f25>   DW_AT_decl_column : 6
    <f26>   DW_AT_prototyped  : 1
    <f26>   DW_AT_low_pc      : 0x80005b8
    <f2a>   DW_AT_high_pc     : 0x34
    <f2e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f30>   DW_AT_GNU_all_call_sites: 1
    <f30>   DW_AT_sibling     : <0xf62>
 <2><f34>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <f35>   DW_AT_name        : (indirect string, offset: 0x6b7ff): ppxIdleTaskTCBBuffer
    <f39>   DW_AT_decl_file   : 1
    <f3a>   DW_AT_decl_line   : 129
    <f3b>   DW_AT_decl_column : 52
    <f3c>   DW_AT_type        : <0xf0c>
    <f40>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f43>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <f44>   DW_AT_name        : (indirect string, offset: 0x756ab): ppxIdleTaskStackBuffer
    <f48>   DW_AT_decl_file   : 1
    <f49>   DW_AT_decl_line   : 129
    <f4a>   DW_AT_decl_column : 88
    <f4b>   DW_AT_type        : <0xf18>
    <f4f>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><f52>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <f53>   DW_AT_name        : (indirect string, offset: 0x8b2bc): pulIdleTaskStackSize
    <f57>   DW_AT_decl_file   : 1
    <f58>   DW_AT_decl_line   : 129
    <f59>   DW_AT_decl_column : 122
    <f5a>   DW_AT_type        : <0xde4>
    <f5e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f61>: Abbrev Number: 0
 <1><f62>: Abbrev Number: 39 (DW_TAG_subprogram)
    <f63>   DW_AT_external    : 1
    <f63>   DW_AT_name        : (indirect string, offset: 0xbe599): vApplicationMallocFailedHook
    <f67>   DW_AT_decl_file   : 1
    <f68>   DW_AT_decl_line   : 110
    <f69>   DW_AT_decl_column : 6
    <f6a>   DW_AT_prototyped  : 1
    <f6a>   DW_AT_low_pc      : 0x80005aa
    <f6e>   DW_AT_high_pc     : 0xe
    <f72>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f74>   DW_AT_GNU_all_call_sites: 1
 <1><f74>: Abbrev Number: 38 (DW_TAG_subprogram)
    <f75>   DW_AT_external    : 1
    <f75>   DW_AT_name        : (indirect string, offset: 0x49ce3): vApplicationStackOverflowHook
    <f79>   DW_AT_decl_file   : 1
    <f7a>   DW_AT_decl_line   : 101
    <f7b>   DW_AT_decl_column : 6
    <f7c>   DW_AT_prototyped  : 1
    <f7c>   DW_AT_low_pc      : 0x8000594
    <f80>   DW_AT_high_pc     : 0x16
    <f84>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f86>   DW_AT_GNU_all_call_sites: 1
    <f86>   DW_AT_sibling     : <0xfa9>
 <2><f8a>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x91fb0): xTask
    <f8f>   DW_AT_decl_file   : 1
    <f90>   DW_AT_decl_line   : 101
    <f91>   DW_AT_decl_column : 48
    <f92>   DW_AT_type        : <0xadc>
    <f96>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f99>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x45304): pcTaskName
    <f9e>   DW_AT_decl_file   : 1
    <f9f>   DW_AT_decl_line   : 101
    <fa0>   DW_AT_decl_column : 68
    <fa1>   DW_AT_type        : <0xfa9>
    <fa5>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><fa8>: Abbrev Number: 0
 <1><fa9>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <faa>   DW_AT_byte_size   : 4
    <fab>   DW_AT_type        : <0x45>
 <1><faf>: Abbrev Number: 39 (DW_TAG_subprogram)
    <fb0>   DW_AT_external    : 1
    <fb0>   DW_AT_name        : (indirect string, offset: 0x57c15): vApplicationTickHook
    <fb4>   DW_AT_decl_file   : 1
    <fb5>   DW_AT_decl_line   : 90
    <fb6>   DW_AT_decl_column : 13
    <fb7>   DW_AT_prototyped  : 1
    <fb7>   DW_AT_low_pc      : 0x8000586
    <fbb>   DW_AT_high_pc     : 0xe
    <fbf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fc1>   DW_AT_GNU_all_call_sites: 1
 <1><fc1>: Abbrev Number: 39 (DW_TAG_subprogram)
    <fc2>   DW_AT_external    : 1
    <fc2>   DW_AT_name        : (indirect string, offset: 0x893da): vApplicationIdleHook
    <fc6>   DW_AT_decl_file   : 1
    <fc7>   DW_AT_decl_line   : 75
    <fc8>   DW_AT_decl_column : 13
    <fc9>   DW_AT_prototyped  : 1
    <fc9>   DW_AT_low_pc      : 0x8000578
    <fcd>   DW_AT_high_pc     : 0xe
    <fd1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fd3>   DW_AT_GNU_all_call_sites: 1
 <1><fd3>: Abbrev Number: 0
  Compilation Unit @ offset 0xfd4:
   Length:        0x6be (32-bit)
   Version:       4
   Abbrev Offset: 0x232
   Pointer Size:  4
 <0><fdf>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <fe0>   DW_AT_producer    : (indirect string, offset: 0x239a0): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <fe4>   DW_AT_language    : 12	(ANSI C99)
    <fe5>   DW_AT_name        : (indirect string, offset: 0xca72e): ../Core/Src/gpio.c
    <fe9>   DW_AT_comp_dir    : (indirect string, offset: 0xa7e16): /home/shokto/STM32CubeIDE/workspace_1.7.0/L432KC_Baseline/Debug
    <fed>   DW_AT_ranges      : 0x48
    <ff1>   DW_AT_low_pc      : 0x0
    <ff5>   DW_AT_stmt_list   : 0xa19
    <ff9>   DW_AT_GNU_macros  : 0x1f93f
 <1><ffd>: Abbrev Number: 2 (DW_TAG_base_type)
    <ffe>   DW_AT_byte_size   : 1
    <fff>   DW_AT_encoding    : 6	(signed char)
    <1000>   DW_AT_name        : (indirect string, offset: 0x66044): signed char
 <1><1004>: Abbrev Number: 3 (DW_TAG_typedef)
    <1005>   DW_AT_name        : (indirect string, offset: 0x3a3bf): __uint8_t
    <1009>   DW_AT_decl_file   : 2
    <100a>   DW_AT_decl_line   : 43
    <100b>   DW_AT_decl_column : 24
    <100c>   DW_AT_type        : <0x1010>
 <1><1010>: Abbrev Number: 2 (DW_TAG_base_type)
    <1011>   DW_AT_byte_size   : 1
    <1012>   DW_AT_encoding    : 8	(unsigned char)
    <1013>   DW_AT_name        : (indirect string, offset: 0xc2fc7): unsigned char
 <1><1017>: Abbrev Number: 2 (DW_TAG_base_type)
    <1018>   DW_AT_byte_size   : 2
    <1019>   DW_AT_encoding    : 5	(signed)
    <101a>   DW_AT_name        : (indirect string, offset: 0x968d2): short int
 <1><101e>: Abbrev Number: 3 (DW_TAG_typedef)
    <101f>   DW_AT_name        : (indirect string, offset: 0xa53f5): __uint16_t
    <1023>   DW_AT_decl_file   : 2
    <1024>   DW_AT_decl_line   : 57
    <1025>   DW_AT_decl_column : 25
    <1026>   DW_AT_type        : <0x102a>
 <1><102a>: Abbrev Number: 2 (DW_TAG_base_type)
    <102b>   DW_AT_byte_size   : 2
    <102c>   DW_AT_encoding    : 7	(unsigned)
    <102d>   DW_AT_name        : (indirect string, offset: 0xc1700): short unsigned int
 <1><1031>: Abbrev Number: 3 (DW_TAG_typedef)
    <1032>   DW_AT_name        : (indirect string, offset: 0x7cbc3): __int32_t
    <1036>   DW_AT_decl_file   : 2
    <1037>   DW_AT_decl_line   : 77
    <1038>   DW_AT_decl_column : 24
    <1039>   DW_AT_type        : <0x103d>
 <1><103d>: Abbrev Number: 2 (DW_TAG_base_type)
    <103e>   DW_AT_byte_size   : 4
    <103f>   DW_AT_encoding    : 5	(signed)
    <1040>   DW_AT_name        : (indirect string, offset: 0x116e7): long int
 <1><1044>: Abbrev Number: 3 (DW_TAG_typedef)
    <1045>   DW_AT_name        : (indirect string, offset: 0x81644): __uint32_t
    <1049>   DW_AT_decl_file   : 2
    <104a>   DW_AT_decl_line   : 79
    <104b>   DW_AT_decl_column : 25
    <104c>   DW_AT_type        : <0x1050>
 <1><1050>: Abbrev Number: 2 (DW_TAG_base_type)
    <1051>   DW_AT_byte_size   : 4
    <1052>   DW_AT_encoding    : 7	(unsigned)
    <1053>   DW_AT_name        : (indirect string, offset: 0x4d898): long unsigned int
 <1><1057>: Abbrev Number: 2 (DW_TAG_base_type)
    <1058>   DW_AT_byte_size   : 8
    <1059>   DW_AT_encoding    : 5	(signed)
    <105a>   DW_AT_name        : (indirect string, offset: 0x5cd45): long long int
 <1><105e>: Abbrev Number: 2 (DW_TAG_base_type)
    <105f>   DW_AT_byte_size   : 8
    <1060>   DW_AT_encoding    : 7	(unsigned)
    <1061>   DW_AT_name        : (indirect string, offset: 0x29e14): long long unsigned int
 <1><1065>: Abbrev Number: 4 (DW_TAG_base_type)
    <1066>   DW_AT_byte_size   : 4
    <1067>   DW_AT_encoding    : 5	(signed)
    <1068>   DW_AT_name        : int
 <1><106c>: Abbrev Number: 2 (DW_TAG_base_type)
    <106d>   DW_AT_byte_size   : 4
    <106e>   DW_AT_encoding    : 7	(unsigned)
    <106f>   DW_AT_name        : (indirect string, offset: 0x10d18): unsigned int
 <1><1073>: Abbrev Number: 3 (DW_TAG_typedef)
    <1074>   DW_AT_name        : (indirect string, offset: 0x3a3c1): uint8_t
    <1078>   DW_AT_decl_file   : 3
    <1079>   DW_AT_decl_line   : 24
    <107a>   DW_AT_decl_column : 19
    <107b>   DW_AT_type        : <0x1004>
 <1><107f>: Abbrev Number: 5 (DW_TAG_const_type)
    <1080>   DW_AT_type        : <0x1073>
 <1><1084>: Abbrev Number: 3 (DW_TAG_typedef)
    <1085>   DW_AT_name        : (indirect string, offset: 0x93975): uint16_t
    <1089>   DW_AT_decl_file   : 3
    <108a>   DW_AT_decl_line   : 36
    <108b>   DW_AT_decl_column : 20
    <108c>   DW_AT_type        : <0x101e>
 <1><1090>: Abbrev Number: 3 (DW_TAG_typedef)
    <1091>   DW_AT_name        : (indirect string, offset: 0x7cbc5): int32_t
    <1095>   DW_AT_decl_file   : 3
    <1096>   DW_AT_decl_line   : 44
    <1097>   DW_AT_decl_column : 19
    <1098>   DW_AT_type        : <0x1031>
 <1><109c>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <109d>   DW_AT_type        : <0x1090>
 <1><10a1>: Abbrev Number: 3 (DW_TAG_typedef)
    <10a2>   DW_AT_name        : (indirect string, offset: 0x92f37): uint32_t
    <10a6>   DW_AT_decl_file   : 3
    <10a7>   DW_AT_decl_line   : 48
    <10a8>   DW_AT_decl_column : 20
    <10a9>   DW_AT_type        : <0x1044>
 <1><10ad>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <10ae>   DW_AT_type        : <0x10a1>
 <1><10b2>: Abbrev Number: 5 (DW_TAG_const_type)
    <10b3>   DW_AT_type        : <0x10a1>
 <1><10b7>: Abbrev Number: 7 (DW_TAG_variable)
    <10b8>   DW_AT_name        : (indirect string, offset: 0x4722): ITM_RxBuffer
    <10bc>   DW_AT_decl_file   : 4
    <10bd>   DW_AT_decl_line   : 2047
    <10bf>   DW_AT_decl_column : 25
    <10c0>   DW_AT_type        : <0x109c>
    <10c4>   DW_AT_external    : 1
    <10c4>   DW_AT_declaration : 1
 <1><10c4>: Abbrev Number: 8 (DW_TAG_variable)
    <10c5>   DW_AT_name        : (indirect string, offset: 0x9833c): SystemCoreClock
    <10c9>   DW_AT_decl_file   : 5
    <10ca>   DW_AT_decl_line   : 58
    <10cb>   DW_AT_decl_column : 17
    <10cc>   DW_AT_type        : <0x10a1>
    <10d0>   DW_AT_external    : 1
    <10d0>   DW_AT_declaration : 1
 <1><10d0>: Abbrev Number: 9 (DW_TAG_array_type)
    <10d1>   DW_AT_type        : <0x107f>
    <10d5>   DW_AT_sibling     : <0x10e0>
 <2><10d9>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <10da>   DW_AT_type        : <0x106c>
    <10de>   DW_AT_upper_bound : 15
 <2><10df>: Abbrev Number: 0
 <1><10e0>: Abbrev Number: 5 (DW_TAG_const_type)
    <10e1>   DW_AT_type        : <0x10d0>
 <1><10e5>: Abbrev Number: 8 (DW_TAG_variable)
    <10e6>   DW_AT_name        : (indirect string, offset: 0xb6e17): AHBPrescTable
    <10ea>   DW_AT_decl_file   : 5
    <10eb>   DW_AT_decl_line   : 60
    <10ec>   DW_AT_decl_column : 23
    <10ed>   DW_AT_type        : <0x10e0>
    <10f1>   DW_AT_external    : 1
    <10f1>   DW_AT_declaration : 1
 <1><10f1>: Abbrev Number: 9 (DW_TAG_array_type)
    <10f2>   DW_AT_type        : <0x107f>
    <10f6>   DW_AT_sibling     : <0x1101>
 <2><10fa>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <10fb>   DW_AT_type        : <0x106c>
    <10ff>   DW_AT_upper_bound : 7
 <2><1100>: Abbrev Number: 0
 <1><1101>: Abbrev Number: 5 (DW_TAG_const_type)
    <1102>   DW_AT_type        : <0x10f1>
 <1><1106>: Abbrev Number: 8 (DW_TAG_variable)
    <1107>   DW_AT_name        : (indirect string, offset: 0x82437): APBPrescTable
    <110b>   DW_AT_decl_file   : 5
    <110c>   DW_AT_decl_line   : 61
    <110d>   DW_AT_decl_column : 23
    <110e>   DW_AT_type        : <0x1101>
    <1112>   DW_AT_external    : 1
    <1112>   DW_AT_declaration : 1
 <1><1112>: Abbrev Number: 9 (DW_TAG_array_type)
    <1113>   DW_AT_type        : <0x10b2>
    <1117>   DW_AT_sibling     : <0x1122>
 <2><111b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <111c>   DW_AT_type        : <0x106c>
    <1120>   DW_AT_upper_bound : 11
 <2><1121>: Abbrev Number: 0
 <1><1122>: Abbrev Number: 5 (DW_TAG_const_type)
    <1123>   DW_AT_type        : <0x1112>
 <1><1127>: Abbrev Number: 8 (DW_TAG_variable)
    <1128>   DW_AT_name        : (indirect string, offset: 0x8c636): MSIRangeTable
    <112c>   DW_AT_decl_file   : 5
    <112d>   DW_AT_decl_line   : 62
    <112e>   DW_AT_decl_column : 23
    <112f>   DW_AT_type        : <0x1122>
    <1133>   DW_AT_external    : 1
    <1133>   DW_AT_declaration : 1
 <1><1133>: Abbrev Number: 11 (DW_TAG_structure_type)
    <1134>   DW_AT_byte_size   : 44
    <1135>   DW_AT_decl_file   : 6
    <1136>   DW_AT_decl_line   : 452
    <1138>   DW_AT_decl_column : 9
    <1139>   DW_AT_sibling     : <0x11ca>
 <2><113d>: Abbrev Number: 12 (DW_TAG_member)
    <113e>   DW_AT_name        : (indirect string, offset: 0xca6cc): MODER
    <1142>   DW_AT_decl_file   : 6
    <1143>   DW_AT_decl_line   : 454
    <1145>   DW_AT_decl_column : 17
    <1146>   DW_AT_type        : <0x10ad>
    <114a>   DW_AT_data_member_location: 0
 <2><114b>: Abbrev Number: 12 (DW_TAG_member)
    <114c>   DW_AT_name        : (indirect string, offset: 0xca81a): OTYPER
    <1150>   DW_AT_decl_file   : 6
    <1151>   DW_AT_decl_line   : 455
    <1153>   DW_AT_decl_column : 17
    <1154>   DW_AT_type        : <0x10ad>
    <1158>   DW_AT_data_member_location: 4
 <2><1159>: Abbrev Number: 12 (DW_TAG_member)
    <115a>   DW_AT_name        : (indirect string, offset: 0xca85a): OSPEEDR
    <115e>   DW_AT_decl_file   : 6
